{
    "TITLE": "Step 1: Define the Evaluation Scope",
    "INTRO": "Define the general parameters and scope of the review. Specify whether there is any part or parts of the website that are NOT going to be analysed because they are outside the scope. Some cases could be:<ul><li>when there are pages, contents or documents that are outside the scope of the <a href='https://www.boe.es/buscar/act.php? id=BOE-A-2018-12699' hreflang='es' title='Spanish Royal Decree 1112/2018 (opens in a new window)'>RD 1112/2018</a>, such as PDF documents located in XXX that will not be analysed because they were published before the RD</li><li>when different websites of an organisation have URLs as follows:<ul><li>URL of website 1 'http://www.xxxxxx/website1/home.html'</li><li>URL of website 2 'http://www.xxxxx/website2/home.html'</li></ul>If the report is from Website 1, only the pages within the directory '/sitesweb1/' will be analysed because those outside '/sitesweb1/' belong to another website that is not being analysed in this report. </li></ul>More information about this step is provided in <a href={{link_step1}} title='WCAG-EM Step 1: Define the scope of the revision (opens in new window)'>WCAG-EM Step 1: Define the scope of the revision</a>.",
    "LABEL_SITE_NAME": "Website name",
    "INF_SITE_NAME": "Provide a name for the website that you would like to evaluate. For example:<ul><li>Public website of the organisation Example</li><li>Website of the organisation Example</li><li>University intranet</li></ul>",
    "LABEL_SITE_SCOPE": "Scope of the website",
    "INF_SITE_SCOPE_0": "Define the scope of the website, so it is clear which web pages are included in the evaluation. For example:",
    "INF_SITE_SCOPE_LI0": "'All web content of the public website of Example Org. located at http://www.example.org'",
    "INF_SITE_SCOPE_LI1": "'All web content of the online shop of Example Org. located at http://www.example.org/shop/'",
    "INF_SITE_SCOPE_LI2": "'All web content of the mobile version of the public website of Example Org. located at http://m.example.org'",
    "INF_SITE_SCOPE_1": "WCAG-EM Step 1.a: Define the Scope of the Website",
    "LABEL_WCAG_VERSION": "WCAG Version",
    "INFO_WCAG_VERSION": "Select the WCAG version to be used. Remember that the version required by law is WCAG 2.1 (default), which is the version of the WCAG aligned to the <a href='https://www.etsi.org/deliver/etsi_en/301500_301599/301549/02.01.02_60/en_301549v020102p.pdf' title='PDF document of the EN 301 549 V2.1.2 (2018-08) standard (opens in new window)'>EN 301 549 V2 standard. 1.2 (2018-08)</a>, declared as a harmonised standard by the European Commission in the <a href='https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32018D2048' title='Commission Implementing Decision (EU) 2018/2048 (opens in new window)'>Commission Implementing Decision (EU) 2018/2048</a>.",
	"WCAG21": "WCAG 2.1",
    "WCAG20": "WCAG 2.0",
    "LABEL_CONFORMANCE_TGT": "Conformance target",
    "INF_CONF_TGT": "Select a level of compliance for the assessment ('A', 'AA' or 'AAA' for the selected WCAG). Remember that the <a href='https://www.etsi.org/deliver/etsi_en/301500_301599/301549/02.01.02_60/en_301549v020102p.pdf' title='PDF document of the standard EN 301 549 V2.1.2 (2018-08) (opens in new window)'>standard EN 301 549 V2.1.2 (2018-08) 'Accessibility requirements for ICT products and services'</a>) is the harmonised standard declared by the European Commission in the <a href='https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32018D2048' title='Commission Implementing Decision (EU) 2018/2048 (opens in new window)'>Commission Implementing Decision (EU) (EU) 2018/2048</a>. This standard, aligned with W3C WCAG 2.1, requires a compliance level of 'AA'. Therefore, if you choose a 'AAA' compliance level, the compliance criteria associated with this level will not be exported in the ODS (LibreOffice) or XLSX (Microsoft Excel) files. They will be exported in HTML and JSON files. For more information, visit <a href={{link_em_1b}} title='WCAG-EM Step 1.b: Define the Conformance Target (opens in new window)'>WCAG-EM Step 1.b: Define the Conformance Target</a>. This selection determines which conformity level filters are active by default in 'step 4: Audit the Sample'.",
    "INF_SUPPORT_BASE": "Define the minimum set of combinations of operating systems, web browsers, support products and other <a href={{link_user_agent}} title='user agents (opens in new window)'>user agents</a> for which the <a href={{link_access_supp}} title='accessibility (opens in new window)'>accessibility</a> of the website is supported, that is, those environments in which the website is expected to function correctly and with adequate accessibility support. In particular, it will be necessary to indicate with which operating system and browser the review has been carried out (including the exact version) and whether, once the review has been completed or in parallel, the website has been tested with some support product, such as NVDA, Jaws, VoiceOver..., for example, 'Internet Explorer (IE) with JAWS', 'FireFox with NVDA', and 'Apple with VoiceOver', could be basic definitions. For more information, see <a href={{link_em_step1c}} title='WCAG-EM Step 1.c: Define an Accessibility Support Baseline (opens in new window)'>WCAG-EM Step 1.c: Define an Accessibility Support Baseline</a>.",
    "LABEL_EXTRA_REQUIREMENTS": "Additional evaluation requirements",
    "INF_EXTRA_REQUIREMENTS_0": "Define any additional evaluation requirements. For example:",
    "INF_EXTRA_REQUIREMENTS_LI0": "'The report will include a list of all errors identified by the evaluator, rather than examples only'",
    "INF_EXTRA_REQUIREMENTS_LI1": "'The report will include a description of the problem and repair suggestions for any errors listed'",
    "INF_EXTRA_REQUIREMENTS_LI2": "'The evaluation will cover all web pages and web content of the website, rather than a selected sample only'",
    "INF_EXTRA_REQUIREMENTS_1": "WCAG-EM Step 1.d: Define Additional Evaluation Requirements"
}
