{
    "TITLE": "AER Tool (Accessibility Evaluation Report)",
    "SUBTITLE": "Website Accessibility Evaluation Report Generator",
    "INTRO_HD": "What this tool does",
    "INTRO_1": "This tool helps you generate a report according to the <a href={{link_wcagem}} title='Website Accessibility Conformance Evaluation Methodology (WCAG-EM) (opens in new window)'>Website Accessibility Conformance Evaluation Methodology (WCAG-EM)</a>. It does not perform any accessibility checks. It helps you follow the steps of WCAG-EM, to generate a <a href={{link_report}} title='structured report (opens in new window)'>structured report</a> from the input that you provide. It is designed for experienced evaluators who know <a href={{link_wcag}} title='Web Content Accessibility Guidelines (WCAG) 2 (opens in new window)'>Web Content Accessibility Guidelines (WCAG) 2</a> and are somewhat familiar with WCAG-EM. For an introduction to WCAG-EM, see the <a href={{link_conformance}} title='WCAG-EM Overview (opens in new window)'>WCAG-EM Overview</a>.",
    "INTRO_2": "<strong>Note:</strong> This tool does not automatically save the information that you enter. To save your data in a file locally on your computer, use Windows shortcut keys Ctrl+S or Mac shortcut keys {{mac}} to open the Save dialog. (Or the 'Save' link at the top of the page will open the Save Evaluation Report page and from there the 'Save data file locally to your computer' link will open the Save dialog).",
    "USAGE_HD": "How this tool works",
    "USAGE_LI1": "All functionality provided by this tool is now loaded and running locally in your web browser. You don't need an Internet connection beyond this point. When you close your web browser window, any unsaved data is lost.",
    "USAGE_LI2": "All input that you provide through this tool is recorded as JSON data in the background (in your web browser, not on any server). You can Save periodically as you work to avoid losing data if your web browser closes.",
    "USAGE_LI3": "You can save partially-complete reports and work on them later. To reload a saved file, use the 'Open' link at the top and find the file that you previously saved.",
    "USAGE_LI4": "Links that are not part of the navigation or functionality (links to external resources) open in a new web browser windows.",
    "TIPS_HD": "Tips for using this tool",
    "TIPS_LI1": "You can go back and forth between the steps in any order. None of the fields are required.",
    "TIPS_LI2": "To get more information about a field, select the {{info}} icon next to the field label.",
    "TIPS_LI3": "You can add as many pages as you consider necessary to the sample selection (Step 3: Select a representative sample) but it is recommended that you do <strong>not exceed 35 pages</strong>, which is more than enough to make a representative page sample. If you still decide to add more pages to the sample, remember that these pages will not be added to the report if you decide to export it as ODS or XLSX. They will be included in all other cases.",
    "TIPS_LI4": "<strong>Save</strong> your progress from time to time to avoid losing the information you have entered with the 'Save' option in the main menu. Your progress will be saved in a <strong>JSON file</strong> which you can then return to <strong>load</strong> using the 'Open' option in the main menu.",
	"TIPS_LI5": "The tool will generate an accessibility review report in various formats (HTML, ODS, XLSX and JSON). You can download these files from the 'View Report' page. By downloading the HTML version along with the CSS stylesheet, you can later change the report content and visual design. Remember that if you download the report in JSON format, you can reload it and continue working on it later from this tool.",
    "TIPS_LI6": "You can include in your report the WCAG compliance criteria beyond the compliance objective required by law (remember that the <strong>level of compliance required by law is 'AA'</strong>, which is the level required by <a href='https://www.etsi.org/deliver/etsi_en/301500_301599/301549/02.01.02_60/en_301549v020102p.pdf' title='PDF document of standard EN 301 549 V2.1.2 (2018-08) (opens in new window)'>standard EN 301 549 V2.1.2 (2018-08)</a>, declared as a harmonised standard by the <a href='https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=CELEX:32018D2048' title='Commission Implementing Decision (EU) 2018/2048 (opens in new window)'>Commission Implementing Decision (EU) 2018/2048</a> and aligned with W3C WCAG 2.1). For example, although the website is only required to comply with the 'AA' compliance level, it may also include the 'AAA' level compliance criteria in the report. In step 4, use the level filter to display the higher level criteria. Any compliance criteria that have a result will always be included in the report, unless the <strong>export is done in an ODS (<a href='https://www.libreoffice.org/' title='LibreOffice (opens in new window)'>LibreOffice</a>) file or XLSX (Microsoft Excel) file</strong>, in which case <strong>these criteria will not be included</strong> (level 'AAA' compliance criteria)."
}