{
	"principles":[
		{
			"id":"WCAG2:perceivable",
			"num":"1",
			"versions":[
				"2.0",
				"2.1"
			],
			"handle":"Perceptible",
			"text":"La información y los componentes de interfaz de usuario debe ser presentable a los usuarios en formas que pueden percibir.",
			"guidelines":[
				{
					"id":"WCAG2:text-alternatives",
					"alt_id":[
						"text-equiv"
					],
					"num":"1.1",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Alternativas De Texto",
					"text":"Proporcionar alternativas textuales para cualquier contenido no textual de modo que se puede transformar en otras formas de la gente necesita, tales como letra grande, braille, voz, símbolos o en un lenguaje más sencillo.",
					"successcriteria":[
						{
							"id":"WCAG2:non-text-content",
							"alt_id":[
								"text-equiv-all"
							],
							"num":"1.1.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Contenido no textual",
							"text":"Todo contenido no textual que se presenta al usuario tiene una alternativa textual que cumple el mismo propósito, excepto en las situaciones enumeradas a continuación.",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Controles, Entrada de datos",
											"text":"Si el contenido no textual es un control o acepta datos introducidos por el usuario, entonces tiene un nombre que describe su propósito. (Véase la Pauta 4.1 para requisitos adicionales sobre los controles y el contenido que aceptan entrada de datos)."
										},
										{
											"handle":"Contenido multimedia tempodependiente",
											"text":"i el contenido no textual es una presentación multimedia con desarrollo temporal, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual. (Véase la Pauta 1.2 para requisitos adicionales sobre contenido multimedia)."
										},
										{
											"handle":"Pruebas",
											"text":"Si el contenido no textual es una prueba o un ejercicio que no sería válido si se presentara en forma de texto, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual."
										},
										{
											"handle":"Sensorial",
											"text":"Si el contenido no textual tiene como objetivo principal el crear una experiencia sensorial específica, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual."
										},
										{
											"handle":"CAPTCHA",
											"text":"Si el propósito del contenido no textual es confirmar que quien está accediendo al contenido es una persona y no una computadora, entonces se proporcionan alternativas textuales que identifican y describen el propósito del contenido no textual y se proporcionan formas alternativas de CAPTCHA con modos de salida para distintos tipos de percepciones sensoriales, con el fin de acomodarse a las diferentes discapacidades"
										},
										{
											"handle":"Decoración, Formato, Invisible",
											"text":"Si el contenido no textual es simple decoración, se utiliza únicamente para definir el formato visual o no se presenta a los usuarios, entonces se implementa de forma que pueda ser ignorado por las ayudas técnicas."
										}
									]
								}
							]
						}
					]
				},
				{
					"id":"WCAG2:time-based-media",
					"alt_id":[
						"media-equiv"
					],
					"num":"1.2",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Basado en el tiempo de los Medios de comunicación",
					"text":"Proporcionar alternativas para el tiempo basado en los medios de comunicación.",
					"successcriteria":[
						{
							"id":"WCAG2:audio-only-and-video-only-prerecorded",
							"alt_id":[
								"media-equiv-av-only-alt"
							],
							"num":"1.2.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Sólo audio y sólo vídeo (grabado)",
							"text":"Para pregrabado solo de audio y de video pregrabado-sólo los medios de comunicación, la siguiente es cierto, excepto cuando el audio o el vídeo es un medio de comunicación alternativo para el texto y está claramente identificado como tal:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Sólo audio grabado",
											"text":"Se proporciona una alternativa para los medios tempodependientes que presenta información equivalente para el contenido sólo audio grabado"
										},
										{
											"handle":"Sólo vídeo grabado",
											"text":"Se proporciona una alternativa para los medios tempodependientes o se proporciona una pista sonora que presenta información equivalente al contenido del medio de sólo vídeo grabado."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:captions-prerecorded",
							"alt_id":[
								"media-equiv-captions"
							],
							"num":"1.2.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Subtítulos (grabados)",
							"text":"Se proporcionan subtítulos para el contenido de audio grabado dentro de contenido multimedia sincronizado, excepto cuando la presentación es un contenido multimedia alternativo al texto y está claramente identificado como tal. (Nivel A)"
						},
						{
							"id":"WCAG2:audio-description-or-media-alternative-prerecorded",
							"alt_id":[
								"media-equiv-audio-desc"
							],
							"num":"1.2.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Audiodescripción o de Medio Alternativo (grabado)",
							"text":"Se proporciona una alternativa para los medios tempodependientes o una audiodescripción para el contenido de vídeo grabado en los multimedia sincronizados, excepto cuando ese contenido es un contenido multimedia alternativo al texto y está claramente identificado como tal."
						},
						{
							"id":"WCAG2:captions-live",
							"alt_id":[
								"media-equiv-real-time-captions"
							],
							"num":"1.2.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Subtítulos (en directo)",
							"text":"Se proporcionan subtítulos para todo el contenido de audio en directo de los multimedia sincronizados.",
							"sufficientNotes":[
								"Los subtítulos pueden ser generados en tiempo real mediante la traducción de textos."
							]
						},
						{
							"id":"WCAG2:audio-description-prerecorded",
							"alt_id":[
								"media-equiv-audio-desc-only"
							],
							"num":"1.2.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Audiodescripción (grabado)",
							"text":"Se proporciona una audiodescripción para todo el contenido de vídeo grabado dentro de contenido multimedia sincronizado."
						},
						{
							"id":"WCAG2:sign-language-prerecorded",
							"alt_id":[
								"media-equiv-sign"
							],
							"num":"1.2.6",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Lengua de señas (grabado)",
							"text":"Se proporciona una interpretación en lengua de señas para todo el contenido de audio grabado dentro de contenido multimedia sincronizado. (Nivel AAA)"
						},
						{
							"id":"WCAG2:extended-audio-description-prerecorded",
							"alt_id":[
								"media-equiv-extended-ad"
							],
							"num":"1.2.7",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Audiodescripción ampliada (grabada)",
							"text":"Cuando las pausas en el audio de primer plano son insuficientes para permitir que la audiodescripción comunique el significado del vídeo, se proporciona una audiodescripción ampliada para todos los contenidos de vídeo grabado dentro de contenido multimedia sincronizado. (Nivel AAA)"
						},
						{
							"id":"WCAG2:media-alternative-prerecorded",
							"alt_id":[
								"media-equiv-text-doc"
							],
							"num":"1.2.8",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Medio alternativo (grabado)",
							"text":"Se proporciona una alternativa para los medios tempodependientes, tanto para todos los contenidos multimedia sincronizados grabados como para todos los medios de sólo vídeo grabado. (Nivel AAA)"
						},
						{
							"id":"WCAG2:audio-only-live",
							"alt_id":[
								"media-equiv-live-audio-only"
							],
							"num":"1.2.9",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Sólo audio (en directo)",
							"text":"Se proporciona una alternativa para los medios tempodependientes que presenta información equivalente para el contenido de sólo audio en directo. (Nivel AAA)"
						}
					]
				},
				{
					"id":"WCAG2:adaptable",
					"alt_id":[
						"content-structure-separation"
					],
					"num":"1.3",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Adaptable",
					"text":"Crear contenido que se puede presentar en diferentes formas (por ejemplo diseño más simple) sin perder información o estructura.",
					"successcriteria":[
						{
							"id":"WCAG2:info-and-relationships",
							"alt_id":[
								"content-structure-separation-programmatic"
							],
							"num":"1.3.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Información y relaciones",
							"text":"La información, estructura y relaciones comunicadas a través de la presentación pueden ser determinadas por software o están disponibles como texto."
						},
						{
							"id":"WCAG2:meaningful-sequence",
							"alt_id":[
								"content-structure-separation-sequence"
							],
							"num":"1.3.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Secuencia significativa",
							"text":"Cuando la secuencia en que se presenta el contenido afecta a su significado, se puede determinar por software la secuencia correcta de lectura."
						},
						{
							"id":"WCAG2:sensory-characteristics",
							"alt_id":[
								"content-structure-separation-understanding"
							],
							"num":"1.3.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Características sensoriales",
							"text":"Las instrucciones proporcionadas para entender y operar el contenido no dependen exclusivamente en las características sensoriales de los componentes como su forma, tamaño, ubicación visual, orientación o sonido. (Nivel A)\n\n",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Para los requisitos relacionados con el color, véase la Pauta 1.4."
								}
							]
						},
						{
							"id":"WCAG2:orientation",
							"alt_id":[
							],
							"num":"1.3.4",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Orientación",
							"text":"El contenido no restringe su visualización y funcionamiento a una única orientación de pantalla, como vertical u horizontal, a menos que sea esencial una orientación de pantalla específica."
						},
						{
							"id":"WCAG2:identify-input-purpose",
							"alt_id":[
							],
							"num":"1.3.5",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Identificar el propósito de campo",
							"text":"El propósito de cada campo de entrada que recoge información sobre el usuario puede ser determinado programáticamente cuando:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"text":"El campo de entrada sirve a un propósito identificado en los propósitos de entrada de los componentes de la interfaz de usuario; y\n"
										},
										{
											"text":"El contenido se implementa usando tecnologías con soporte para identificar el significado esperado de los datos de entrada en formularios."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:identify-purpose",
							"alt_id":[
							],
							"num":"1.3.6",
							"versions":[
								"2.1"
							],
							"level":"AAA",
							"handle":"Identificar El Propósito",
							"text":"En el contenido implementado utilizando lenguajes de marcado, el propósito de los componentes de la interfaz de usuario, los iconos y las regiones pueden ser determinados programáticamente."
						}
					]
				},
				{
					"id":"WCAG2:distinguishable",
					"alt_id":[
						"visual-audio-contrast"
					],
					"num":"1.4",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Distinguible",
					"text":"Hacer que sea más fácil para los usuarios ver y oír el contenido, incluyendo la separación de primer plano del fondo.",
					"successcriteria":[
						{
							"id":"WCAG2:use-of-color",
							"alt_id":[
								"visual-audio-contrast-without-color"
							],
							"num":"1.4.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Uso del color",
							"text":"El color no se usa como único medio visual para transmitir la información, indicar una acción, solicitar una respuesta o distinguir un elemento visual. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Este criterio de conformidad trata específicamente acerca de la percepción del color. En la Pauta 1.3 se recogen otras formas de percepción, incluyendo el acceso por software al color y a otros códigos de presentación visual."
								}
							]
						},
						{
							"id":"WCAG2:audio-control",
							"alt_id":[
								"visual-audio-contrast-dis-audio"
							],
							"num":"1.4.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Control del audio",
							"text":"Si el audio de una página web suena automáticamente durante más de 3 segundos, se proporciona ya sea un mecanismo para pausar o detener el audio, o un mecanismo para controlar el volumen del sonido que es independiente del nivel de volumen global del sistema. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"En la medida en que cualquier contenido que no satisfaga este criterio puede interferir con la capacidad del usuario de emplear la página en su conjunto, todo contenido de la página web (tanto si satisface o no otros criterios de conformidad) debe satisfacer este criterio. Véase Requisito de Conformidad 5: Sin interferencia."
								}
							]
						},
						{
							"id":"WCAG2:contrast-minimum",
							"alt_id":[
								"visual-audio-contrast-contrast"
							],
							"num":"1.4.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Contraste (mínimo)",
							"text":"La presentación visual de texto e imágenes de texto tiene una relación de contraste de al menos 4,5:1, excepto para lo",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Texto Grande",
											"text":"El texto y las imágenes a gran escala de texto a gran escala tienen una relación de contraste de al menos 3:1;"
										},
										{
											"handle":"Incidental",
											"text":"El texto o las imágenes de texto que forman parte de un componente inactivo de la interfaz de usuario, que son pura decoración, que no son visibles para nadie, o que forman parte de una imagen que contiene otro contenido visual significativo, no tienen requisitos de contraste."
										},
										{
											"handle":"Logotipos",
											"text":"El texto que forma parte de un logotipo o marca no tiene un requisito de contraste mínimo."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:resize-text",
							"alt_id":[
								"visual-audio-contrast-scale"
							],
							"num":"1.4.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Redimensión del texto",
							"text":"A excepción de los subtítulos y las imágenes de texto, el texto puede redimensionarse sin tecnología de asistencia hasta un 200% sin pérdida de contenido o funcionalidad."
						},
						{
							"id":"WCAG2:images-of-text",
							"alt_id":[
								"visual-audio-contrast-text-presentation"
							],
							"num":"1.4.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Imágenes de texto",
							"text":"Si las tecnologías que se utilizan pueden lograr la presentación visual, el texto se utiliza para transmitir información en lugar de imágenes de texto, con la excepción de lo siguiente:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Personalizable",
											"text":"La imagen del texto se puede personalizar visualmente según las necesidades del usuario;"
										},
										{
											"handle":"Esencial",
											"text":"Una presentación particular del texto es esencial para la información que se transmite."
										}
									]
								},
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Los logotipos (texto que forma parte de un logotipo o marca) se consideran esenciales."
								}
							]
						},
						{
							"id":"WCAG2:contrast-enhanced",
							"alt_id":[
								"visual-audio-contrast7"
							],
							"num":"1.4.6",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Contraste (Mejorado)",
							"text":"La presentación visual de texto e imágenes de texto tiene una relación de contraste de, al menos, 7:1, excepto en los siguientes casos. (Nivel AAA)",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Textos grandes",
											"text":"Los textos de gran tamaño y las imágenes de texto de gran tamaño tienen una relación de contraste de, al menos, 4.5:1."
										},
										{
											"handle":"Incidental",
											"text":"Los textos o imágenes de texto que forman parte de un componente de la interfaz de usuario inactivo, que son simple decoración, que no resultan visibles para nadie o forman parte de una imagen que contiene otros elementos visuales significativos, no tienen requisitos de contraste."
										},
										{
											"handle":"Logotipos",
											"text":"El texto que forma parte de un logo o nombre de marca no tiene requisitos de contraste mínimo."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:low-or-no-background-audio",
							"alt_id":[
								"visual-audio-contrast-noaudio"
							],
							"num":"1.4.7",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Sonido de fondo bajo o ausente",
							"text":"Para el contenido de sólo audio grabado que (1) contiene habla en primer plano, (2) no es un CAPTCHA sonoro o un audiologo, y (3) que no es una vocalización cuya intención principal es servir como expresión musical (como el canto o el rap), se cumple al menos uno de los siguientes casos: (Nivel AAA)",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Ningún sonido de fondo",
											"text":"El audio no contiene sonidos de fondo."
										},
										{
											"handle":"Apagar",
											"text":"Los sonidos de fondo pueden ser apagados."
										},
										{
											"handle":"20 dB",
											"text":"Los sonidos de fondo son, al menos, 20 decibelios más bajos que el discurso en primer plano, con la excepción de sonidos ocasionales que duran solamente uno o dos segundos."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:visual-presentation",
							"alt_id":[
								"visual-audio-contrast-visual-presentation"
							],
							"num":"1.4.8",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Presentación Visual",
							"text":"En la presentación visual de bloques de texto, se proporciona algún mecanismo para lograr lo siguiente: (Nivel AAA)",
							"details":[
								{
									"type":"olist",
									"items":[
										{
											"handle":"",
											"text":"Los colores de fondo y primer plano pueden ser elegidos por el usuario."
										},
										{
											"handle":"",
											"text":"El ancho no es mayor de 80 caracteres o signos (40 si es CJK)."
										},
										{
											"handle":"",
											"text":"El texto no está justificado (alineado a los márgenes izquierdo y derecho a la vez)."
										},
										{
											"handle":"",
											"text":"El espacio entre líneas (interlineado) es de, al menos, un espacio y medio dentro de los párrafos y el espacio entre párrafos es, al menos, 1.5 veces mayor que el espacio entre líneas."
										},
										{
											"handle":"",
											"text":"El texto se ajusta sin ayudas técnicas hasta un 200 por ciento de modo tal que no requiere un desplazamiento horizontal para leer una línea de texto en una ventana a pantalla completa."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:images-of-text-no-exception",
							"alt_id":[
								"visual-audio-contrast-text-images"
							],
							"num":"1.4.9",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Imágenes de texto (sin excepciones)",
							"text":"Las imágenes de texto sólo se utilizan como simple decoración o cuando una forma de presentación particular del texto resulta esencial para la información transmitida. (Nivel AAA)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Los logotipos (textos que son parte de un logo o de un nombre de marca) se consideran esenciales."
								}
							]
						},
						{
							"id":"WCAG2:reflow",
							"alt_id":[
							],
							"num":"1.4.10",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Reflow",
							"text":"El contenido puede ser presentado sin pérdida de información o funcionalidad, y sin necesidad de desplazarse en dos dimensiones:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"text":"Contenido de desplazamiento vertical con un ancho equivalente a 320 píxeles CSS;"
										},
										{
											"text":"Contenido de desplazamiento horizontal a una altura equivalente a 256 píxeles CSS;"
										}
									]
								},
								{
									"type":"p",
									"text":"Excepto para partes del contenido que requieren un diseño bidimensional para su uso o significado."
								}
							]
						},
						{
							"id":"WCAG2:non-text-contrast",
							"alt_id":[
							],
							"num":"1.4.11",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Contraste en elementos no textuales",
							"text":"La presentación visual de los siguientes elementos  tiene una relación de contraste de al menos 3:1 con respecto a los colores adyacentes:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Componentes de la interfaz de usuario",
											"text":"Información visual necesaria para identificar los componentes y estados de la interfaz de usuario, excepto en el caso de los componentes inactivos o cuando la apariencia del componente es determinada por el agente de usuario y no modificada por el autor;"
										},
										{
											"handle":"Objetos gráficos",
											"text":"Partes de los gráficos necesarios para comprender"
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:text-spacing",
							"alt_id":[
							],
							"num":"1.4.12",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Espaciado en el texto",
							"text":"En el contenido implementado usando lenguajes de marcado que soportan las siguientes propiedades de estilo de texto, no se produce ninguna pérdida de contenido o funcionalidad al configurar todo lo siguiente y al no cambiar ninguna otra propiedad de estilo:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"text":"Altura de línea (espaciado de línea) de al menos 1,5 veces el tamaño de la fuente;"
										},
										{
											"text":"Espaciando los párrafos siguientes a por lo menos 2 veces el tamaño de la fuente;"
										},
										{
											"text":"Espaciado de letras (rastreo) a por lo menos 0.12 veces el tamaño de la fuente;"
										},
										{
											"text":"Espacio entre palabras de al menos 0.16 veces el tamaño de la fuente."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:content-on-hover-or-focus",
							"alt_id":[
							],
							"num":"1.4.13",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Contenido en hover o focus",
							"text":"Si al recibir y luego eliminar el puntero o el foco del teclado se activa el contenido adicional para que se haga visible y luego se oculte, lo siguiente es cierto:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Puede retirarse",
											"text":"Un mecanismo está disponible para descartar el contenido adicional sin mover el puntero o el foco del teclado, a menos que el contenido adicional comunique un error de entrada o no oscurezca o reemplace otro contenido;"
										},
										{
											"handle":"Hoverable",
											"text":"Si el puntero puede activar el contenido adicional, entonces el puntero puede moverse sobre el contenido adicional sin que el contenido adicional desaparezca;"
										},
										{
											"handle":"Persistente",
											"text":"El contenido adicional permanece visible hasta que se elimina el cursor o el disparador de enfoque, el usuario lo despide o su información deja de ser válida."
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"id":"WCAG2:operable",
			"num":"2",
			"versions":[
				"2.0",
				"2.1"
			],
			"handle":"Operable",
			"text":"Componentes de interfaz de usuario y la navegación deben ser operables.",
			"guidelines":[
				{
					"id":"WCAG2:keyboard-accessible",
					"alt_id":[
						"keyboard-operation"
					],
					"num":"2.1",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Accesible Con Teclado",
					"text":"Realizar todas las funciones disponibles en un teclado.",
					"successcriteria":[
						{
							"id":"WCAG2:keyboard",
							"alt_id":[
								"keyboard-operation-keyboard-operable"
							],
							"num":"2.1.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Teclado",
							"text":"Toda la funcionalidad del contenido es operable a través de una interfaz de teclado sin que se requiera una determinada velocidad para cada pulsación individual de las teclas, excepto cuando la función interna requiere de una entrada que depende del trayecto de los movimientos del usuario y no sólo de los puntos inicial y final. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Esta excepción se refiere a la función subyacente, no a la técnica de entrada de datos. Por ejemplo, si la entrada de texto se hace por medio de escritura a mano, la técnica de entrada (escritura a mano) depende del trazo (ruta trazada) pero la función interna (introducir texto) no."
								},
								{
									"type":"nota",
									"handle":"Nota 2",
									"text":"Esto no prohíbe ni debería desanimar a los autores a proporcionar entrada de ratón u otros métodos de entrada de datos adicionales a la operabilidad a través del teclado."
								}
							]
						},
						{
							"id":"WCAG2:no-keyboard-trap",
							"alt_id":[
								"keyboard-operation-trapping"
							],
							"num":"2.1.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Sin trampas para el foco del teclado",
							"text":"Si es posible mover el foco a un componente de la página usando una interfaz de teclado, entonces el foco se puede quitar de ese componente usando sólo la interfaz de teclado y, si se requiere algo más que las teclas de dirección o de tabulación, se informa al usuario el método apropiado para mover el foco. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"En la medida en que cualquier contenido que no satisfaga este criterio puede interferir con la capacidad del usuario para emplear la página por completo, todo contenido de la página web (tanto si satisface o no otros criterios de conformidad) debe satisfacer este criterio. Véase Requisito de Conformidad 5: Sin interferencia."
								}
							]
						},
						{
							"id":"WCAG2:keyboard-no-exception",
							"alt_id":[
								"keyboard-operation-all-funcs"
							],
							"num":"2.1.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Teclado (sin excepciones)",
							"text":"Toda la funcionalidad del contenido se puede operar a través de una interfaz de teclado sin requerir una determinada velocidad en la pulsación de las teclas. (Nivel AAA)"
						},
						{
							"id":"WCAG2:character-key-shortcuts",
							"alt_id":[
							],
							"num":"2.1.4",
							"versions":[
								"2.1"
							],
							"level":"A",
							"handle":"Atajos con teclas de carcteres",
							"text":"En el caso de que para activar los elementos de interacción (enlaces, botones, etc.) se empleen atajos de teclado usando una única letra, signo de puntuación, número o símbolo entonces se debe cumplir al menos una de las siguientes condiciones:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Apague",
											"text":"Existe un mecanismo que permite desactivar el atajo de teclado"
										},
										{
											"handle":"Reasignación de",
											"text":"Existe un mecanismo que permite reasignar el atajo de teclado para emplear en su lugar otra tecla no imprimible (ej, Ctrl, Alt, etc.)"
										},
										{
											"handle":"Activo sólo en el foco",
											"text":"El atajo de teclado sólo se puede activar cuando el componente tiene el foco del teclado."
										}
									]
								}
							]
						}
					]
				},
				{
					"id":"WCAG2:enough-time",
					"alt_id":[
						"time-limits"
					],
					"num":"2.2",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Tiempo Suficiente",
					"text":"Proporcionar a los usuarios el tiempo suficiente para leer y usar el contenido.",
					"successcriteria":[
						{
							"id":"WCAG2:timing-adjustable",
							"alt_id":[
								"time-limits-required-behaviors"
							],
							"num":"2.2.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Tiempo ajustable",
							"text":"Para cada límite de tiempo impuesto por el contenido, se cumple al menos uno de los siguientes casos: (Nivel A)",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Apagar",
											"text":"El usuario puede desactivar el límite de tiempo antes de encontrarse con ella; o"
										},
										{
											"handle":"Ajustar",
											"text":"El usuario puede ajustar el límite de tiempo antes de alcanzar dicho límite en un rango amplio que es, al menos, diez veces"
										},
										{
											"handle":"Extender",
											"text":"e advierte al usuario antes de que el tiempo expire y se le conceden al menos 20 segundos para extender el límite temporal con una acción simple (por ejemplo, \"presione la barra de espacio\") y el usuario puede extender ese límite de tiempo al menos diez veces; o"
										},
										{
											"handle":"De excepciones en tiempo Real",
											"text":"El límite de tiempo es una parte necesaria de eventos en tiempo real (por ejemplo, una subasta), y no hay alternativa para el límite de tiempo es posible; o"
										},
										{
											"handle":"Excepción",
											"text":"El límite de tiempo es esencial y la ampliación de invalidaría la actividad; o"
										},
										{
											"handle":"Excepción de 20 horas",
											"text":"El límite de tiempo es de más de 20 horas."
										}
									]
								},
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Este criterio de éxito ayuda a garantizar que los usuarios pueden completar las tareas sin inesperados cambios en el contenido o contexto en el que son el resultado de un límite de tiempo. Este criterio de éxito debe ser considerado conjuntamente con el Criterio de Éxito 3.2.1, que pone límites a los cambios de contenido o el contexto, como resultado de una acción del usuario."
								}
							]
						},
						{
							"id":"WCAG2:pause-stop-hide",
							"alt_id":[
								"time-limits-pause"
							],
							"num":"2.2.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Poner en pausa, detener, ocultar",
							"text":"Para la información que tiene movimiento, parpadeo, se desplaza o se actualiza automáticamente, se cumplen todos los casos siguientes: (Nivel A)",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Movimiento, parpadeo, desplazamiento",
											"text":"Para toda información que se mueve, parpadea o se desplaza, que (1) comienza automáticamente, (2) dura más de cinco segundos y (3) se presenta en paralelo con otro contenido, existe un mecanismo para que el usuario la pueda poner en pausa, detener u ocultar, a menos que el movimiento, parpadeo o desplazamiento sea parte esencial de una actividad; y"
										},
										{
											"handle":"Actualización automática",
											"text":"Para toda información que se actualiza automáticamente, que (1) se inicia automáticamente y (2) se presenta …"
										}
									]
								},
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Para los requisitos relacionados con el parpadeo o el destello de contenido, véase la Pauta 2.3"
								},
								{
									"type":"nota",
									"handle":"Nota 2",
									"text":"En la medida en que cualquier contenido que no satisfaga este criterio puede interferir con la capacidad del usuario para emplear la página como un todo, todo contenido de la página web (tanto si satisface o no otros criterios de conformidad) debe satisfacer este criterio. Véase Requisito de Conformidad 5: Sin interferencia."
								},
								{
									"type":"nota",
									"handle":"Nota 3",
									"text":"Para el contenido que es actualizado periódicamente por medio de un software, o que se sirve a la aplicación de usuario por medio de streaming, no hay obligación de preservar o presentar la información que ha sido generada o recibida entre el inicio de la pausa y el reinicio de la presentación; no sólo podría no ser técnicamente posible, sino que además en muchas ocasiones podría ser erróneo o engañoso hacerlo."
								},
								{
									"type":"nota",
									"handle":"Nota 4",
									"text":"Una animación que ocurre como parte de una fase de precarga de un contenido o una situación similar puede ser considerada esencial si no se permite interacción a ningún usuario durante esa fase, y si el hecho de no indicar el progreso pudiera confundir a los usuarios y hacerles creer que ha habido un fallo en el contenido.\n\nCómo cumplir 2.2.2 |Comprender 2.2.2\n\n"
								}
							]
						},
						{
							"id":"WCAG2:no-timing",
							"alt_id":[
								"time-limits-no-exceptions"
							],
							"num":"2.2.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Sin Tiempo",
							"text":"El tiempo no es parte esencial del evento o actividad presentada por el contenido, exceptuando los multimedia sincronizados no interactivos y los eventos en tiempo real. (Nivel AAA)"
						},
						{
							"id":"WCAG2:interruptions",
							"alt_id":[
								"time-limits-postponed"
							],
							"num":"2.2.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Interrupciones",
							"text":"El usuario puede postergar o suprimir las interrupciones, excepto cuando las interrupciones implican una emergencia. (Nivel AAA)"
						},
						{
							"id":"WCAG2:re-authenticating",
							"alt_id":[
								"time-limits-server-timeout"
							],
							"num":"2.2.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Re-autenticación",
							"text":"Cuando expira una sesión autentificada, el usuario puede continuar la actividad sin pérdida de datos tras volver a identificarse. (Nivel AAA)"
						},
						{
							"id":"WCAG2:timeouts",
							"alt_id":[
							],
							"num":"2.2.6",
							"versions":[
								"2.1"
							],
							"level":"AAA",
							"handle":"Tiempos de espera",
							"text":"Se advierte a los usuarios de la duración de cualquier inactividad del usuario que pueda causar la pérdida de datos, a menos que los datos se conserven durante más de 20 horas cuando el usuario no tome ninguna medida."
						}
					]
				},
				{
					"id":"WCAG2:seizures-and-physical-reactions",
					"alt_id":[
						"seizure"
					],
					"num":"2.3",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Las convulsiones y Reacciones Físicas",
					"text":"No diseñar contenido en una forma que se conoce para causar convulsiones o reacciones físicas.",
					"successcriteria":[
						{
							"id":"WCAG2:three-flashes-or-below-threshold",
							"alt_id":[
								"seizure-does-not-violate"
							],
							"num":"2.3.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Umbral de tres destellos o menos",
							"text":"Las páginas web no contienen nada que destelle más de tres veces en un segundo, o el destello está por debajo del umbral de destello general y de destello rojo. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"En la medida en que cualquier contenido que no satisfaga este criterio puede interferir con la capacidad del usuario para emplear la página como un todo, todo contenido de la página web (tanto si satisface o no otros criterios de conformidad) debe satisfacer este criterio. Véase Requisito de Conformidad 5: Sin interferencia."
								}
							]
						},
						{
							"id":"WCAG2:three-flashes",
							"alt_id":[
								"seizure-three-times"
							],
							"num":"2.3.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Tres Destellos",
							"text":"Las páginas web no contienen nada que destelle más de tres veces por segundo. (Nivel AAA)"
						},
						{
							"id":"WCAG2:animation-from-interactions",
							"alt_id":[
							],
							"num":"2.3.3",
							"versions":[
								"2.1"
							],
							"level":"AAA",
							"handle":"La animación de las Interacciones",
							"text":"La animación de movimiento activada por la interacción puede ser desactivada, a menos que la animación sea esencial para la funcionalidad o la información que se transmite."
						}
					]
				},
				{
					"id":"WCAG2:navigable",
					"alt_id":[
						"navigation-mechanisms"
					],
					"num":"2.4",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Navegable",
					"text":"Proporcionar los medios para ayudar a los usuarios a navegar, encontrar contenido y determinar dónde se encuentran.",
					"successcriteria":[
						{
							"id":"WCAG2:bypass-blocks",
							"alt_id":[
								"navigation-mechanisms-skip"
							],
							"num":"2.4.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Evitar bloques",
							"text":"Existe un mecanismo para evitar los bloques de contenido que se repiten en múltiples páginas web. (Nivel A)"
						},
						{
							"id":"WCAG2:page-titled",
							"alt_id":[
								"navigation-mechanisms-title"
							],
							"num":"2.4.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Titulado de  páginas",
							"text":"Las páginas web tienen títulos que describen su temática o propósito. (Nivel A)"
						},
						{
							"id":"WCAG2:focus-order",
							"alt_id":[
								"navigation-mechanisms-focus-order"
							],
							"num":"2.4.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Orden del foco",
							"text":"Si se puede navegar secuencialmente por una página web y la secuencia de navegación afecta su significado o su operación, los componentes que pueden recibir el foco lo hacen en un orden que preserva su significado y operabilidad. (Nivel A)"
						},
						{
							"id":"WCAG2:link-purpose-in-context",
							"alt_id":[
								"navigation-mechanisms-refs"
							],
							"num":"2.4.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Propósito de los enlaces (en contexto)",
							"text":"El propósito de cada enlace puede ser determinado con sólo el texto del enlace o a través del texto del enlace sumado al contexto del enlace determinado por software, excepto cuando el propósito del enlace resultara ambiguo para los usuarios en general. (Nivel A)"
						},
						{
							"id":"WCAG2:multiple-ways",
							"alt_id":[
								"navigation-mechanisms-mult-loc"
							],
							"num":"2.4.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Múltiples vías",
							"text":"Se proporciona más de un camino para localizar una página web dentro de un conjunto de páginas web, excepto cuando la página es el resultado, o un paso intermedio, de un proceso. (Nivel AA)"
						},
						{
							"id":"WCAG2:headings-and-labels",
							"alt_id":[
								"navigation-mechanisms-descriptive"
							],
							"num":"2.4.6",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Encabezados y etiquetas",
							"text":"Los encabezados y etiquetas describen el tema o propósito. (Nivel AA)",
							"sufficientNotes":[
								"Los encabezados y etiquetas deben ser de programación determinado, por <a href='#contenido-estructura-separación-programático'>Criterio de Éxito 1.3.1</a>."
							]
						},
						{
							"id":"WCAG2:focus-visible",
							"alt_id":[
								"navigation-mechanisms-focus-visible"
							],
							"num":"2.4.7",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Foco visible",
							"text":"Cualquier interfaz de usuario operable por teclado tiene una forma de operar en la cuál el indicador del foco del teclado resulta visible. (Nivel AA)"
						},
						{
							"id":"WCAG2:location",
							"alt_id":[
								"navigation-mechanisms-location"
							],
							"num":"2.4.8",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Ubicación",
							"text":"Se proporciona información acerca de la ubicación del usuario dentro de un conjunto de páginas web. (Nivel AAA)"
						},
						{
							"id":"WCAG2:link-purpose-link-only",
							"alt_id":[
								"navigation-mechanisms-link"
							],
							"num":"2.4.9",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Propósito de los enlaces (sólo enlaces)",
							"text":"Se proporciona un mecanismo que permite identificar el propósito de cada enlace con sólo el texto del enlace, excepto cuando el propósito del enlace resultara ambiguo para los usuarios en general. (Nivel AAA)"
						},
						{
							"id":"WCAG2:section-headings",
							"alt_id":[
								"navigation-mechanisms-headings"
							],
							"num":"2.4.10",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Encabezados de sección",
							"text":"Se usan encabezados de sección para organizar el contenido. (Nivel AAA)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"\"Encabezados\" se usa en sentido general e incluye los títulos y otras formas de agregar encabezados a las distintos tipos de contenido."
								},
								{
									"type":"nota",
									"handle":"Nota 2",
									"text":"Este criterio de conformidad se refiere al contenido propiamente dicho, no a los componentes de la interfaz de usuario. Los componentes de la interfaz de usuario se tratan en el Criterio de Conformidad 4.1.2."
								}
							]
						}
					]
				},
				{
					"id":"WCAG2:input-modalities",
					"alt_id":[
					],
					"num":"2.5",
					"versions":[
						"2.1"
					],
					"handle":"De Entrada Modalidades",
					"text":"Hacer que sea más fácil para los usuarios a utilizar la funcionalidad a través de diversos insumos, más allá de teclado.",
					"successcriteria":[
						{
							"id":"WCAG2:pointer-gestures",
							"alt_id":[
							],
							"num":"2.5.1",
							"versions":[
								"2.1"
							],
							"level":"A",
							"handle":"Gestos del puntero",
							"text":"Todas las funciones que utilizan gestos multipunto o basados ​​en ruta para la operación pueden operarse con un solo puntero sin un gesto basado en ruta, a menos que sea esencial un gesto multipunto o basado en ruta."
						},
						{
							"id":"WCAG2:pointer-cancellation",
							"alt_id":[
							],
							"num":"2.5.2",
							"versions":[
								"2.1"
							],
							"level":"A",
							"handle":"Cancelación del puntero",
							"text":"Para la funcionalidad que puede operarse con un solo puntero, al menos uno de los siguientes es verdadero:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Sin evento descendente",
											"text":"el evento descendente del puntero no se utiliza para ejecutar ninguna parte de la función;"
										},
										{
											"handle":"Abortar o Deshacer",
											"text":"la finalización de la función está en el evento up, y hay un mecanismo disponible para abortar la función antes de que se complete o para deshacer la función después de que se complete;"
										},
										{
											"handle":"Inversión ascendente",
											"text":"el evento ascendente invierte cualquier resultado del evento descendente anterior;"
										},
										{
											"handle":"Esencial",
											"text":"completar la función en el evento descendente es esencial."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:label-in-name",
							"alt_id":[
							],
							"num":"2.5.3",
							"versions":[
								"2.1"
							],
							"level":"A",
							"handle":"Etiqueta en el nombre",
							"text":"Para los componentes de la interfaz de usuario con etiquetas que incluyen texto o imágenes de texto, el nombre contiene el texto que se presenta visualmente."
						},
						{
							"id":"WCAG2:motion-actuation",
							"alt_id":[
							],
							"num":"2.5.4",
							"versions":[
								"2.1"
							],
							"level":"A",
							"handle":"Activación mediante movimiento",
							"text":"La funcionalidad que puede ser operada por el movimiento del dispositivo o el movimiento del usuario también puede ser operada por los componentes de la interfaz del usuario y la respuesta al movimiento se puede desactivar para evitar la activación accidental, excepto cuando:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Interfaz compatible",
											"text":"el movimiento se utiliza para operar la funcionalidad a través de una interfaz compatible de accesibilidad;"
										},
										{
											"handle":"Esencial",
											"text":"el movimiento es esencial para la función y hacerlo invalidaría la actividad."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:target-size",
							"alt_id":[
							],
							"num":"2.5.5",
							"versions":[
								"2.1"
							],
							"level":"AAA",
							"handle":"Tamaño De Destino",
							"text":"El tamaño del objetivo para las entradas de los punteros es de al menos 44 por 44 píxeles CSS, excepto cuando:",
							"details":[
								{
									"type":"ulist",
									"items":[
										{
											"handle":"Equivalente",
											"text":"El objetivo está disponible a través de un enlace o control equivalente en la misma página que tiene al menos 44 por 44 píxeles CSS;"
										},
										{
											"handle":"En línea",
											"text":"El objetivo está en una frase o bloque de texto;"
										},
										{
											"handle":"Control del agente de usuario",
											"text":"El tamaño del objetivo es determinado por el agente usuario y no es modificado por el autor;"
										},
										{
											"handle":"Esencial",
											"text":"Una presentación particular del objetivo es esencial para la información que se transmite."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:concurrent-input-mechanisms",
							"alt_id":[
							],
							"num":"2.5.6",
							"versions":[
								"2.1"
							],
							"level":"AAA",
							"handle":"Mecanismos de entrada concurrentes",
							"text":"El contenido de la web no restringe el uso de las modalidades de entrada disponibles en una plataforma, salvo cuando la restricción es esencial, necesaria para garantizar la seguridad del contenido o requerida para respetar la configuración del usuario."
						}
					]
				}
			]
		},
		{
			"id":"WCAG2:understandable",
			"num":"3",
			"versions":[
				"2.0",
				"2.1"
			],
			"handle":"Comprensible",
			"text":"La información y el funcionamiento de la interfaz de usuario deben ser comprensibles.",
			"guidelines":[
				{
					"id":"WCAG2:readable",
					"alt_id":[
						"meaning"
					],
					"num":"3.1",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Legible",
					"text":"Hacer que el contenido de texto legible y comprensible.",
					"successcriteria":[
						{
							"id":"WCAG2:language-of-page",
							"alt_id":[
								"meaning-doc-lang-id"
							],
							"num":"3.1.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Idioma de la página",
							"text":"El idioma predeterminado de cada página web puede ser determinado por software. (Nivel A)"
						},
						{
							"id":"WCAG2:language-of-parts",
							"alt_id":[
								"meaning-other-lang-id"
							],
							"num":"3.1.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Idioma de las partes",
							"text":"El idioma de cada pasaje o frase en el contenido puede ser determinado por software, excepto los nombres propios, términos técnicos, palabras en un idioma indeterminado y palabras o frases que se hayan convertido en parte natural del texto que las rodea. (Nivel AA)"
						},
						{
							"id":"WCAG2:unusual-words",
							"alt_id":[
								"meaning-idioms"
							],
							"num":"3.1.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Palabras Inusuales",
							"text":"Se proporciona un mecanismo para identificar las definiciones específicas de palabras o frases usadas de modo inusual o restringido, incluyendo expresiones idiomáticas y jerga. (Nivel AAA)"
						},
						{
							"id":"WCAG2:abbreviations",
							"alt_id":[
								"meaning-located"
							],
							"num":"3.1.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Abreviaturas",
							"text":"Se proporciona un mecanismo para identificar la forma expandida o el significado de las abreviaturas. (Nivel AAA)"
						},
						{
							"id":"WCAG2:reading-level",
							"alt_id":[
								"meaning-supplements"
							],
							"num":"3.1.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Nivel de lectura",
							"text":"Cuando un texto requiere un nivel de lectura más avanzado que el nivel mínimo de educación secundaria una vez que se han eliminado nombres propios y títulos, se proporciona un contenido suplementario o una versión que no requiere un nivel de lectura mayor a ese nivel educativo. (Nivel AAA)",
							"sufficientNotes":[
								"Diferentes sitios de mayo de dirección de este Criterio de Éxito de diferentes maneras. Una versión en audio del contenido puede ser útil para algunos usuarios. Para algunas personas que son sordas, una versión en lenguaje de signos de la página puede ser más fácil de comprender que el lenguaje escrito, versión, ya que la lengua de señas puede ser su primer idioma. Algunos sitios pueden decidir hacer ambas cosas u otras combinaciones. Una técnica que ayudará a todos los usuarios que tienen dificultad. Tan diferentes técnicas se proporcionan suficiente de las técnicas aquí para los autores, tratando de hacer que sus sitios sean más accesibles. Cualquier numeradas de la técnica o la combinación puede ser utilizada por un sitio en particular y es considerada suficiente por el Grupo de Trabajo."
							]
						},
						{
							"id":"WCAG2:pronunciation",
							"alt_id":[
								"meaning-pronunciation"
							],
							"num":"3.1.6",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Pronunciación",
							"text":"Se proporciona un mecanismo para identificar la pronunciación específica de las palabras cuando el significado de esas palabras, dentro del contexto, resulta ambiguo si no se conoce su pronunciación. (Nivel AAA)"
						}
					]
				},
				{
					"id":"WCAG2:predictable",
					"alt_id":[
						"consistent-behavior"
					],
					"num":"3.2",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Predecible",
					"text":"Hacer que las páginas Web aparezcan y operen de manera predecible.",
					"successcriteria":[
						{
							"id":"WCAG2:on-focus",
							"alt_id":[
								"consistent-behavior-receive-focus"
							],
							"num":"3.2.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Al recibir el foco",
							"text":"Cuando cualquier componente recibe el foco, no inicia ningún cambio en el contexto. (Nivel A)",
							"sufficientNotes":[
								"Un cambio de contenido no es siempre un cambio de contexto. Este criterio de éxito es automáticamente se reunió si los cambios en los contenidos no son también los cambios de contexto."
							]
						},
						{
							"id":"WCAG2:on-input",
							"alt_id":[
								"consistent-behavior-unpredictable-change"
							],
							"num":"3.2.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Al recibir entradas",
							"text":"El cambio de estado en cualquier componente de la interfaz de usuario no provoca automáticamente un cambio en el contexto a menos que el usuario haya sido advertido de ese comportamiento antes de usar el componente. (Nivel A)",
							"sufficientNotes":[
								"Un cambio de contenido no es siempre un cambio de contexto. Este criterio de éxito es automáticamente se reunió si los cambios en los contenidos no son también los cambios de contexto."
							]
						},
						{
							"id":"WCAG2:consistent-navigation",
							"alt_id":[
								"consistent-behavior-consistent-locations"
							],
							"num":"3.2.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Navegación coherente",
							"text":"Los mecanismos de navegación que se repiten en múltiples páginas web dentro de un conjunto de páginas web aparecen siempre en el mismo orden relativo cada vez que se repiten, a menos que el cambio sea provocado por el propio usuario. (Nivel AA)"
						},
						{
							"id":"WCAG2:consistent-identification",
							"alt_id":[
								"consistent-behavior-consistent-functionality"
							],
							"num":"3.2.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Identificación coherente",
							"text":"Los componentes que tienen la misma funcionalidad dentro de un conjunto de páginas web son identificados de manera coherente. (Nivel AA)",
							"sufficientNotes":[
								"Alternativas de texto que son \"consistentes\", no siempre son \"idénticos\". Por ejemplo, usted puede tener una gráfica de flecha en la parte inferior de una página Web que enlace a la siguiente página Web. El texto alternativo puede decir \"Ir a la página 4.\" Naturalmente, no sería conveniente repetir este texto exacto alternativa en la siguiente página Web. Sería más apropiado decir \"Ir a la página 5\". Aunque estas alternativas de texto no sería idéntico, que sea consistente, y por lo tanto satisfacer este Criterio de Éxito.",
								"Una sola no-texto-contenido-objeto puede ser utilizado para servir a diferentes funciones. En tales casos, las diferentes alternativas de texto son necesarios y deben ser utilizados. Ejemplos pueden ser encontrados comúnmente con el uso de iconos, tales como marcas de verificación, cruz marcas y señales de tráfico. Sus funciones pueden ser diferentes dependiendo del contexto de la página Web. Un icono de marca de verificación puede funcionar como \"aprobado\", \"terminada\", o \"incluido\", para nombrar unos pocos, dependiendo de la situación. El uso de \"marca de verificación\" como texto alternativo en todas las páginas Web no ayuda a los usuarios a comprender la función del icono. Diferentes alternativas de texto puede ser utilizado cuando el mismo contenido no textual que sirve para múltiples funciones."
							]
						},
						{
							"id":"WCAG2:change-on-request",
							"alt_id":[
								"consistent-behavior-no-extreme-changes-context"
							],
							"num":"3.2.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Cambios a petición",
							"text":"Los cambios en el contexto son iniciados únicamente a solicitud del usuario o se proporciona un mecanismo para detener tales cambios. (Nivel AAA)"
						}
					]
				},
				{
					"id":"WCAG2:input-assistance",
					"alt_id":[
						"minimize-error"
					],
					"num":"3.3",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"La Entrada De Ayuda",
					"text":"Ayudar a los usuarios a evitar y corregir errores.",
					"successcriteria":[
						{
							"id":"WCAG2:error-identification",
							"alt_id":[
								"minimize-error-identified"
							],
							"num":"3.3.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Identificación de errores",
							"text":"Si se detecta automáticamente un error en la entrada de datos, el elemento erróneo es identificado y el error se describe al usuario mediante un texto. (Nivel A)"
						},
						{
							"id":"WCAG2:labels-or-instructions",
							"alt_id":[
								"minimize-error-cues"
							],
							"num":"3.3.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Etiquetas o instrucciones",
							"text":"Se proporcionan etiquetas o instrucciones cuando el contenido requiere la introducción de datos por parte del usuario. (Nivel A)",
							"sufficientNotes":[
								"Las técnicas al final de la lista anterior debe ser considerado como \"último recurso\" y sólo se utilizan cuando las otras técnicas no pueden ser aplicados a la página. Las anteriores técnicas son las preferidas porque a aumentar la accesibilidad a un amplio grupo de usuarios."
							]
						},
						{
							"id":"WCAG2:error-suggestion",
							"alt_id":[
								"minimize-error-suggestions"
							],
							"num":"3.3.3",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Sugerencias ante errores",
							"text":"Si se detecta automáticamente un error en la entrada de datos y se dispone de sugerencias para hacer la corrección, entonces se presentan las sugerencias al usuario, a menos que esto ponga en riesgo la seguridad o el propósito del contenido. (Nivel AA)"
						},
						{
							"id":"WCAG2:error-prevention-legal-financial-data",
							"alt_id":[
								"minimize-error-reversible"
							],
							"num":"3.3.4",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AA",
							"handle":"Prevención de errores (legales, financieros, datos)",
							"text":"Para las páginas web que representan para el usuario compromisos legales o transacciones financieras; que modifican o eliminan datos controlables por el usuario en sistemas de almacenamiento de datos; o que envían las respuestas del usuario a una prueba, se cumple al menos uno de los siguientes casos: (Nivel AA)",
							"details":[
								{
									"type":"olist",
									"items":[
										{
											"handle":"Reversible",
											"text":"El envío es reversible."
										},
										{
											"handle":"Revisado",
											"text":"Se verifica la información para detectar errores en la entrada de datos y se proporciona al usuario una oportunidad de corregirlos."
										},
										{
											"handle":"Confirmado",
											"text":"Se proporciona un mecanismo para revisar, confirmar y corregir la información antes de finalizar el envío de los datos."
										}
									]
								}
							]
						},
						{
							"id":"WCAG2:help",
							"alt_id":[
								"minimize-error-context-help"
							],
							"num":"3.3.5",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Ayuda",
							"text":"Se proporciona ayuda dependiente del contexto . (Nivel AAA)"
						},
						{
							"id":"WCAG2:error-prevention-all",
							"alt_id":[
								"minimize-error-reversible-all"
							],
							"num":"3.3.6",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"AAA",
							"handle":"Prevención De Errores (Todos)",
							"text":"Para las páginas web que requieren al usuario el envío de información, se cumple al menos uno de los siguientes casos. (Nivel AAA)",
							"details":[
								{
									"type":"olist",
									"items":[
										{
											"handle":"Reversible",
											"text":"El envío es reversible."
										},
										{
											"handle":"Revisado",
											"text":"Se verifica la información para detectar errores en la entrada de datos y se proporciona al usuario una oportunidad de corregirlos."
										},
										{
											"handle":"Confirmado",
											"text":"Se proporciona un mecanismo para revisar, confirmar y corregir la información antes de finalizar el envío de los datos."
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"id":"WCAG2:robust",
			"num":"4",
			"versions":[
				"2.0",
				"2.1"
			],
			"handle":"Robusto",
			"text":"El contenido debe ser suficientemente robusto que puede interpretarse de forma fiable por una amplia variedad de agentes de usuario, incluidas las tecnologías de asistencia.",
			"guidelines":[
				{
					"id":"WCAG2:compatible",
					"alt_id":[
						"ensure-compat"
					],
					"num":"4.1",
					"versions":[
						"2.0",
						"2.1"
					],
					"handle":"Compatible",
					"text":"Maximizar la compatibilidad con las actuales y futuras de los agentes de usuario, incluidas las tecnologías de asistencia.",
					"successcriteria":[
						{
							"id":"WCAG2:parsing",
							"alt_id":[
								"ensure-compat-parses"
							],
							"num":"4.1.1",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Procesamiento",
							"text":"En los contenidos implementados mediante el uso de lenguajes de marcas, los elementos tienen las etiquetas de apertura y cierre completas; los elementos están anidados de acuerdo a sus especificaciones; los elementos no contienen atributos duplicados y los ID son únicos, excepto cuando las especificaciones permitan estas características. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Las etiquetas de apertura y cierre a las que les falte un carácter crítico para su formación, como un signo de \"mayor qué\", o en las que falten las comillas de apertura o cierre en el valor de un atributo, no se consideran completas."
								}
							]
						},
						{
							"id":"WCAG2:name-role-value",
							"alt_id":[
								"ensure-compat-rsv"
							],
							"num":"4.1.2",
							"versions":[
								"2.0",
								"2.1"
							],
							"level":"A",
							"handle":"Nombre, función, valor",
							"text":"Para todos los componentes de la interfaz de usuario (incluyendo pero no limitado a: elementos de formulario, enlaces y componentes generados por scripts), el nombre y la función pueden ser determinados por software; los estados, propiedades y valores que pueden ser asignados por el usuario pueden ser especificados por software; y los cambios en estos elementos se encuentran disponibles para su consulta por las aplicaciones de usuario, incluyendo las ayudas técnicas. (Nivel A)",
							"details":[
								{
									"type":"nota",
									"handle":"Nota 1",
									"text":"Este criterio de conformidad se dirige principalmente a los autores web que desarrollan o programan sus propios componentes de interfaz de usuario. Por ejemplo, los controles estándar de HTML satisfacen automáticamente este criterio cuando se emplean de acuerdo con su especificación."
								}
							]
						},
						{
							"id":"WCAG2:status-messages",
							"alt_id":[
							],
							"num":"4.1.3",
							"versions":[
								"2.1"
							],
							"level":"AA",
							"handle":"Mensajes de estado",
							"text":"En el contenido implementado utilizando lenguajes de marcado, los mensajes de estado se pueden determinar mediante roles o propiedades, de modo que se puedan presentar al usuario mediante tecnologías de asistencia sin recibir atención."
						}
					]
				}
			]
		}
	]
}
