{
    "principles": [
        {
            "id": "WCAG2:perceivable",
            "num": "1",
            "versions": [
                "2.0",
                "2.1"
            ],
            "handle": "Perceptible",
            "text": "La información y los componentes de interfaz de usuario debe ser presentable a los usuarios en formas que pueden percibir.",
            "guidelines": [
                {
                    "id": "WCAG2:text-alternatives",
                    "alt_id": [
                        "text-equiv"
                    ],
                    "num": "1.1",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Alternativas De Texto",
                    "text": "Proporcionar alternativas textuales para cualquier contenido no textual de modo que se puede transformar en otras formas de la gente necesita, tales como letra grande, braille, voz, símbolos o en un lenguaje más sencillo.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:non-text-content",
                            "alt_id": [
                                "text-equiv-all"
                            ],
                            "num": "1.1.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Contenido no textual",
                            "text": "Todo el contenido no textual que se presenta al usuario tiene un texto alternativo que sirve el equivalente a propósito, excepto para las situaciones que se indican a continuación.",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Controles De Entrada",
                                            "text": "Si el contenido no textual es un control o acepta la entrada del usuario, entonces tiene un nombre que describe su propósito. (Consulte la Guía 4.1 requisitos adicionales para los controles y el contenido que acepta la entrada del usuario.)"
                                        },
                                        {
                                            "handle": "Basado En El Tiempo De Los Medios De Comunicación",
                                            "text": "Si el contenido no textual es basado en el tiempo de los medios de comunicación, luego de texto alternativas, al menos, identificación descriptiva del contenido no textual. (Consulte la Guía 1.2 requisitos adicionales para los medios de comunicación.)"
                                        },
                                        {
                                            "handle": "Prueba",
                                            "text": "Si el contenido no textual es una prueba o ejercicio que no sería válida si se presenta en el texto, a continuación, el texto de alternativas, al menos, identificación descriptiva del contenido no textual."
                                        },
                                        {
                                            "handle": "Sensorial",
                                            "text": "Si el contenido no textual es principalmente diseñado para crear una experiencia sensorial, a continuación, el texto de alternativas, al menos, identificación descriptiva del contenido no textual."
                                        },
                                        {
                                            "handle": "CAPTCHA",
                                            "text": "Si el propósito del contenido no textual es para confirmar que el contenido es la que se accede por una persona en lugar de un ordenador, a continuación, el texto de las alternativas que identificar y describir el propósito del contenido no textual, y formas alternativas de CAPTCHA uso de modos de salida para los diferentes tipos de percepción sensorial se proporcionan para dar cabida a las diferentes discapacidades."
                                        },
                                        {
                                            "handle": "La Decoración, El Formato, La Invisible",
                                            "text": "Si el contenido no textual es pura decoración, sólo se utiliza para visual de formato, o no se presentan a los usuarios, a continuación, se lleva a cabo en una forma que puede ser ignorado por la tecnología de asistencia."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:time-based-media",
                    "alt_id": [
                        "media-equiv"
                    ],
                    "num": "1.2",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Basado en el tiempo de los Medios de comunicación",
                    "text": "Proporcionar alternativas para el tiempo basado en los medios de comunicación.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:audio-only-and-video-only-prerecorded",
                            "alt_id": [
                                "media-equiv-av-only-alt"
                            ],
                            "num": "1.2.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Sólo audio y de sólo vídeo (grabado)",
                            "text": "Para pregrabado solo de audio y de video pregrabado-sólo los medios de comunicación, la siguiente es cierto, excepto cuando el audio o el vídeo es un medio de comunicación alternativo para el texto y está claramente identificado como tal:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Audio pregrabado-sólo",
                                            "text": "Una alternativa para el tiempo basado en los medios de comunicación es siempre que se presenta una información equivalente para el audio pregrabado-sólo el contenido."
                                        },
                                        {
                                            "handle": "Video pregrabado-sólo",
                                            "text": "Una alternativa para el tiempo basado en medios de comunicación o una pista de audio que presenta información equivalente de video pregrabado-sólo el contenido."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:captions-prerecorded",
                            "alt_id": [
                                "media-equiv-captions"
                            ],
                            "num": "1.2.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Subtítulos (grabados)",
                            "text": "Los subtítulos se proporcionan para todos los pregrabado del contenido de audio sincronizado en los medios de comunicación, excepto cuando los medios de comunicación es un medio de comunicación alternativo para el texto y está claramente identificado como tal."
                        },
                        {
                            "id": "WCAG2:audio-description-or-media-alternative-prerecorded",
                            "alt_id": [
                                "media-equiv-audio-desc"
                            ],
                            "num": "1.2.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Audiodescripción o de Medio Alternativo (grabado)",
                            "text": "Una alternativa para el tiempo basado en los medios de comunicación o de audio descripción de el video pregrabado del contenido se proporciona la sincronización de medios de comunicación, excepto cuando los medios de comunicación es un medio de comunicación alternativo para el texto y está claramente identificado como tal."
                        },
                        {
                            "id": "WCAG2:captions-live",
                            "alt_id": [
                                "media-equiv-real-time-captions"
                            ],
                            "num": "1.2.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Subtítulos (en directo)",
                            "text": "Los subtítulos se proporcionan para todos los de audio en vivo de contenido en contenido multimedia sincronizado.",
                            "sufficientNotes": [
                                "Los subtítulos pueden ser generados en tiempo real mediante la traducción de textos."
                            ]
                        },
                        {
                            "id": "WCAG2:audio-description-prerecorded",
                            "alt_id": [
                                "media-equiv-audio-desc-only"
                            ],
                            "num": "1.2.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Audiodescripción (grabado)",
                            "text": "Descripción de Audio se proporciona para todos los video pregrabado de contenido en contenido multimedia sincronizado."
                        },
                        {
                            "id": "WCAG2:sign-language-prerecorded",
                            "alt_id": [
                                "media-equiv-sign"
                            ],
                            "num": "1.2.6",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Lenguaje De Señas (Pregrabado)",
                            "text": "Interpretación en lengua de señas para todas las pregrabado del contenido de audio sincronizado en los medios de comunicación."
                        },
                        {
                            "id": "WCAG2:extended-audio-description-prerecorded",
                            "alt_id": [
                                "media-equiv-extended-ad"
                            ],
                            "num": "1.2.7",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Extendida Descripción De Audio (Pregrabado)",
                            "text": "Donde hace una pausa en el audio de fondo son insuficientes para permitir que las descripciones en audio para transmitir el sentido de la de vídeo, de audio extendidas descripción se proporciona para todos los video pregrabado de contenido en contenido multimedia sincronizado."
                        },
                        {
                            "id": "WCAG2:media-alternative-prerecorded",
                            "alt_id": [
                                "media-equiv-text-doc"
                            ],
                            "num": "1.2.8",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Los Medios De Comunicación Alternativos (Pregrabado)",
                            "text": "Una alternativa para el tiempo basado en los medios de comunicación se proporciona para todos los pregrabados sincronizado medios de comunicación y para todos los de video pregrabado-sólo los medios de comunicación."
                        },
                        {
                            "id": "WCAG2:audio-only-live",
                            "alt_id": [
                                "media-equiv-live-audio-only"
                            ],
                            "num": "1.2.9",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Solo de Audio (en Vivo)",
                            "text": "Una alternativa para el tiempo basado en los medios de comunicación que se presenta una información equivalente para audio en vivo-sólo el contenido es proporcionado."
                        }
                    ]
                },
                {
                    "id": "WCAG2:adaptable",
                    "alt_id": [
                        "content-structure-separation"
                    ],
                    "num": "1.3",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Adaptable",
                    "text": "Crear contenido que se puede presentar en diferentes formas (por ejemplo diseño más simple) sin perder información o estructura.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:info-and-relationships",
                            "alt_id": [
                                "content-structure-separation-programmatic"
                            ],
                            "num": "1.3.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Información y relaciones",
                            "text": "La información, la estructura y las relaciones transmitidos a través de la presentación puede ser determinado mediante programación o están disponibles en el texto."
                        },
                        {
                            "id": "WCAG2:meaningful-sequence",
                            "alt_id": [
                                "content-structure-separation-sequence"
                            ],
                            "num": "1.3.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Secuencia significativa",
                            "text": "Cuando la secuencia en la que el contenido se presenta afecta a su significado, una secuencia correcta de lectura puede ser determinado mediante programación."
                        },
                        {
                            "id": "WCAG2:sensory-characteristics",
                            "alt_id": [
                                "content-structure-separation-understanding"
                            ],
                            "num": "1.3.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Características sensoriales",
                            "text": "Instrucciones para la comprensión y funcionamiento de contenidos no se basan únicamente en las características sensoriales de los componentes, tales como forma, tamaño, visual ubicación, orientación o sonido.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Para los requisitos relacionados con el color, consulte la Directriz 1.4."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:orientation",
                            "alt_id": [],
                            "num": "1.3.4",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Orientación",
                            "text": "Contenido de no restringir su punto de vista y operación de una sola orientación de la pantalla, tales como retrato o paisaje, a menos que exista una orientación de la pantalla es esencial."
                        },
                        {
                            "id": "WCAG2:identify-input-purpose",
                            "alt_id": [],
                            "num": "1.3.5",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Identificar el propósito de campo",
                            "text": "El propósito de cada campo de entrada de recogida de información sobre el usuario puede ser mediante programación determinado cuando:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "text": "El campo de entrada sirve a un propósito identificado en la Entrada de los Fines para los Componentes de Interfaz de Usuario de la sección; y"
                                        },
                                        {
                                            "text": "El contenido se implementa el uso de tecnologías, con el apoyo para la identificación de la espera significado para el formulario de entrada de datos."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:identify-purpose",
                            "alt_id": [],
                            "num": "1.3.6",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Identificar El Propósito",
                            "text": "En el contenido de implementado el uso de lenguajes de marcado, el propósito de Componentes de Interfaz de Usuario, iconos, y las regiones pueden ser mediante programación determinado."
                        }
                    ]
                },
                {
                    "id": "WCAG2:distinguishable",
                    "alt_id": [
                        "visual-audio-contrast"
                    ],
                    "num": "1.4",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Distinguible",
                    "text": "Hacer que sea más fácil para los usuarios ver y oír el contenido, incluyendo la separación de primer plano del fondo.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:use-of-color",
                            "alt_id": [
                                "visual-audio-contrast-without-color"
                            ],
                            "num": "1.4.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Uso del color",
                            "text": "El Color no se utiliza como el único medio visual de comunicación de la información, lo que indica una acción, lo que provocó una respuesta, o distinguir un elemento visual.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Este criterio de éxito de las direcciones de la percepción del color en particular. Otras formas de percepción están cubiertos en la Directriz 1.3 incluyendo el acceso mediante programación a color y otra presentación visual de codificación."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:audio-control",
                            "alt_id": [
                                "visual-audio-contrast-dis-audio"
                            ],
                            "num": "1.4.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Control del audio",
                            "text": "Si alguno de audio en una página Web se reproduce automáticamente durante más de 3 segundos, un mecanismo para poner en pausa o detener el audio, o un mecanismo para el control de volumen de audio de forma independiente del sistema general de nivel de volumen.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Ya que cualquier contenido que no cumpla con este criterio de éxito puede interferir con la capacidad del usuario para utilizar toda la página, todo el contenido de la página Web (si es o no es utilizado para satisfacer otros criterios de éxito) debe cumplir con este criterio de éxito. Vea Requisito De Conformidad 5: No Interferencia."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:contrast-minimum",
                            "alt_id": [
                                "visual-audio-contrast-contrast"
                            ],
                            "num": "1.4.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Contraste (mínimo)",
                            "text": "La presentación visual del texto y las imágenes de texto tiene una relación de contraste de al menos 4.5:1, excepto para los siguientes:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Texto Grande",
                                            "text": "A gran escala el texto y las imágenes de texto a gran escala tienen una relación de contraste de al menos 3:1;"
                                        },
                                        {
                                            "handle": "Incidental",
                                            "text": "El texto o las imágenes de texto que son parte de un inactivo componente de interfaz de usuario, que son pura decoración, que no son visibles para nadie, o que son parte de una imagen que contiene importantes otro contenido visual, no tienen contraste requisito."
                                        },
                                        {
                                            "handle": "Logotipos",
                                            "text": "Texto que es parte de un logo o un nombre de marca no tiene contraste mínimo requisito."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:resize-text",
                            "alt_id": [
                                "visual-audio-contrast-scale"
                            ],
                            "num": "1.4.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Redimensión del texto",
                            "text": "Excepto para los títulos y las imágenes de texto, el texto se puede cambiar de tamaño sin tecnología de apoyo de hasta 200 por ciento, sin pérdida de contenido o funcionalidad."
                        },
                        {
                            "id": "WCAG2:images-of-text",
                            "alt_id": [
                                "visual-audio-contrast-text-presentation"
                            ],
                            "num": "1.4.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Imágenes de texto",
                            "text": "Si las tecnologías que se utilizan pueden lograr la presentación visual de texto, se utiliza para transmitir información, en lugar de imágenes de texto, excepto los siguientes:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Personalizable",
                                            "text": "La imagen de texto puede ser visualmente personalizado a los requerimientos del usuario;"
                                        },
                                        {
                                            "handle": "Esencial",
                                            "text": "En una presentación particular de texto es esencial para la información que se transmite."
                                        }
                                    ]
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Logotipos (texto que es parte de un logotipo o nombre de marca) se consideran esenciales."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:contrast-enhanced",
                            "alt_id": [
                                "visual-audio-contrast7"
                            ],
                            "num": "1.4.6",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Contraste (Mejorado)",
                            "text": "La presentación visual del texto y las imágenes de texto tiene una relación de contraste de al menos 7:1, excepto para los siguientes:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Texto Grande",
                                            "text": "A gran escala el texto y las imágenes de texto a gran escala tienen una relación de contraste de al menos 4.5:1;"
                                        },
                                        {
                                            "handle": "Incidental",
                                            "text": "El texto o las imágenes de texto que son parte de un inactivo componente de interfaz de usuario, que son pura decoración, que no son visibles para nadie, o que son parte de una imagen que contiene importantes otro contenido visual, no tienen contraste requisito."
                                        },
                                        {
                                            "handle": "Logotipos",
                                            "text": "Texto que es parte de un logo o un nombre de marca no tiene contraste mínimo requisito."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:low-or-no-background-audio",
                            "alt_id": [
                                "visual-audio-contrast-noaudio"
                            ],
                            "num": "1.4.7",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Baja o Ninguna experiencia de Audio",
                            "text": "Para audio pregrabado-sólo el contenido que (1) contiene principalmente de voz en primer plano, (2) no es un audio de CAPTCHA o logotipo de audio, y (3) no es la vocalización pretende ser principalmente la expresión musical como cantar o rapear, al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "No De Fondo",
                                            "text": "El audio no contiene sonidos de fondo."
                                        },
                                        {
                                            "handle": "Apague",
                                            "text": "Los sonidos de fondo se puede desactivar."
                                        },
                                        {
                                            "handle": "20 dB",
                                            "text": "Los sonidos de fondo son al menos 20 decibelios más bajo que el primer plano del discurso contenido, con la excepción de ocasionales sonidos que sólo duran uno o dos segundos."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-presentation",
                            "alt_id": [
                                "visual-audio-contrast-visual-presentation"
                            ],
                            "num": "1.4.8",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Presentación Visual",
                            "text": "Para la presentación visual de los bloques de texto, un mecanismo para lograr los siguientes:",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "",
                                            "text": "Primer plano y colores de fondo pueden ser seleccionados por el usuario."
                                        },
                                        {
                                            "handle": "",
                                            "text": "La anchura es de no más de 80 caracteres o pictogramas (40 si CJK)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "El texto no está justificado (alineado a la izquierda y el derecho de los márgenes)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Espaciado de línea (líder) es, al menos, el espacio-y-un-medio dentro de los párrafos, y el espaciado de párrafo es de al menos 1,5 veces mayor que el espaciado de línea."
                                        },
                                        {
                                            "handle": "",
                                            "text": "El texto se puede cambiar de tamaño sin tecnología de apoyo de hasta 200 por ciento en una manera que no requiere que el usuario desplazarse horizontalmente para leer una línea de texto en una ventana de pantalla completa."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:images-of-text-no-exception",
                            "alt_id": [
                                "visual-audio-contrast-text-images"
                            ],
                            "num": "1.4.9",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Imágenes de Texto (Sin Excepción)",
                            "text": "Las imágenes de texto son utilizados solamente por pura decoración, o cuando un particular de la presentación del texto es esencial para la información que se transmite.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Logotipos (texto que es parte de un logotipo o nombre de marca) se consideran esenciales."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:reflow",
                            "alt_id": [],
                            "num": "1.4.10",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Reflow",
                            "text": "El contenido puede ser presentado sin pérdida de información o funcionalidad, y sin necesidad de desplazamiento en dos dimensiones:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "text": "El desplazamiento Vertical de contenido en un ancho equivalente a 320 píxeles CSS;"
                                        },
                                        {
                                            "text": "El desplazamiento Horizontal de contenido a una altura equivalente a 256 píxeles CSS;"
                                        }
                                    ]
                                },
                                {
                                    "type": "p",
                                    "text": "Excepto para las partes de los contenidos que requieren de dos dimensiones de diseño para el uso o significado."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:non-text-contrast",
                            "alt_id": [],
                            "num": "1.4.11",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Contraste en elementos no textuales",
                            "text": "La presentación visual de los siguientes tienen una relación de contraste de al menos 3:1 contra adyacentes de color(s):",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Componentes De Interfaz De Usuario",
                                            "text": "La información Visual necesaria para identificar los componentes de interfaz de usuario y los estados, a excepción de los componentes inactivos o donde la apariencia de los componentes está determinado por el agente de usuario y no modificado por el autor;"
                                        },
                                        {
                                            "handle": "Los Objetos Gráficos",
                                            "text": "Partes de los gráficos necesarios para comprender el contenido, excepto cuando una presentación particular de gráficos es esencial para la información que se transmite."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:text-spacing",
                            "alt_id": [],
                            "num": "1.4.12",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Espaciado en el texto",
                            "text": "En el contenido de implementado el uso de lenguajes de marcado que admiten las siguientes propiedades de estilo de texto, sin pérdida de contenido o funcionalidad se produce mediante la configuración de todos los siguientes, y por el cambio de ningún otro estilo de propiedad:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "text": "La altura de la línea (la línea de separación) para, al menos, 1,5 veces el tamaño de la fuente;"
                                        },
                                        {
                                            "text": "El espaciado de párrafos siguientes a por lo menos 2 veces el tamaño de la fuente;"
                                        },
                                        {
                                            "text": "El espaciado entre letras (seguimiento) para al menos 0.12 veces el tamaño de la fuente;"
                                        },
                                        {
                                            "text": "El espacio entre las palabras, al menos 0.16 veces el tamaño de la fuente."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:content-on-hover-or-focus",
                            "alt_id": [],
                            "num": "1.4.13",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Contenido en hover o focus",
                            "text": "Donde recibir y, a continuación, la eliminación de puntero o el foco del teclado desencadenantes de contenido adicional para hacerse visible y, a continuación, ocultos, los siguientes son verdaderas:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Dismissable",
                                            "text": "Un mecanismo para despedir el contenido adicional sin mover el puntero o el foco del teclado, a menos que el contenido adicional se comunica un error de entrada o de no ocultar o sustituir a otros contenidos;"
                                        },
                                        {
                                            "handle": "Hoverable",
                                            "text": "Si el puntero puede desencadenar el contenido adicional, a continuación, el puntero se puede mover el contenido adicional sin el contenido adicional desapareciendo;"
                                        },
                                        {
                                            "handle": "Persistente",
                                            "text": "El contenido adicional permanece visible hasta que el hover o desencadenador de foco es quitado, el usuario se descarta, o su información no es válida."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:operable",
            "num": "2",
            "versions": [
                "2.0",
                "2.1"
            ],
            "handle": "Operable",
            "text": "Componentes de interfaz de usuario y la navegación deben ser operables.",
            "guidelines": [
                {
                    "id": "WCAG2:keyboard-accessible",
                    "alt_id": [
                        "keyboard-operation"
                    ],
                    "num": "2.1",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Accesible Con Teclado",
                    "text": "Realizar todas las funciones disponibles en un teclado.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:keyboard",
                            "alt_id": [
                                "keyboard-operation-keyboard-operable"
                            ],
                            "num": "2.1.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Teclado",
                            "text": "Toda la funcionalidad de los contenidos es operable a través de una interfaz de teclado sin necesidad de horarios específicos para las teclas individuales, excepto donde la función subyacente requiere la entrada que depende de la ruta de acceso de usuario en el movimiento y no sólo los extremos.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Esta excepción se refiere a la función subyacente, no a la entrada de la técnica. Por ejemplo, si el uso de escritura a mano para escribir texto, la entrada de la técnica (escritura) requiere la ruta de acceso dependiente de la entrada, pero la función subyacente (entrada de texto) no."
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 2",
                                    "text": "Esto no prohíbe y no debe desalentar a proporcionar la entrada del ratón u otros métodos de entrada además de la operación de teclado."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:no-keyboard-trap",
                            "alt_id": [
                                "keyboard-operation-trapping"
                            ],
                            "num": "2.1.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Sin trampas para el foco del teclado",
                            "text": "Si el foco del teclado se puede mover a un componente de la página a través de una interfaz de teclado, a continuación, centrarse puede ser alejado de ese componente utilizando sólo una interfaz de teclado, y, si se requiere más que no modificada de flecha o las teclas de la ficha u otro estándar de los métodos de salida, el usuario es informado de que el método para mover el foco.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Ya que cualquier contenido que no cumpla con este criterio de éxito puede interferir con la capacidad del usuario para utilizar toda la página, todo el contenido de la página Web (tanto si se utiliza para cumplir con otros criterios de éxito o no) debe cumplir con este criterio de éxito. Vea Requisito De Conformidad 5: No Interferencia."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:keyboard-no-exception",
                            "alt_id": [
                                "keyboard-operation-all-funcs"
                            ],
                            "num": "2.1.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Con El Teclado (Sin Excepción)",
                            "text": "Toda la funcionalidad de los contenidos es operable a través de una interfaz de teclado sin necesidad de horarios específicos para las teclas individuales."
                        },
                        {
                            "id": "WCAG2:character-key-shortcuts",
                            "alt_id": [],
                            "num": "2.1.4",
                            "versions": [
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Atajos con teclas de carcteres",
                            "text": "Si un método abreviado de teclado es implementado en el contenido utilizando sólo la carta (incluyendo mayúsculas y minúsculas), los signos de puntuación, números o caracteres de símbolo, entonces al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Apague",
                                            "text": "Un mecanismo para activar el acceso directo apagado;"
                                        },
                                        {
                                            "handle": "Reasignación de",
                                            "text": "Un mecanismo para reasignar el acceso directo para utilizar uno o más de los no-imprimible de los caracteres del teclado (por ejemplo, Ctrl, Alt, etc);"
                                        },
                                        {
                                            "handle": "Activo sólo en el foco",
                                            "text": "El método abreviado de teclado para un componente de interfaz de usuario sólo está activo cuando el componente tiene el foco."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:enough-time",
                    "alt_id": [
                        "time-limits"
                    ],
                    "num": "2.2",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Tiempo Suficiente",
                    "text": "Proporcionar a los usuarios el tiempo suficiente para leer y usar el contenido.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:timing-adjustable",
                            "alt_id": [
                                "time-limits-required-behaviors"
                            ],
                            "num": "2.2.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Tiempo ajustable",
                            "text": "Para cada límite de tiempo establecido por el contenido, al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Apague",
                                            "text": "El usuario puede desactivar el límite de tiempo antes de encontrarse con ella; o"
                                        },
                                        {
                                            "handle": "Ajustar",
                                            "text": "El usuario puede ajustar el límite de tiempo antes de encontrar a través de una amplia gama que es al menos diez veces la longitud de la configuración predeterminada; o"
                                        },
                                        {
                                            "handle": "Ampliar",
                                            "text": "Se advierte al usuario antes de que expire el tiempo y se da al menos 20 segundos para extender el límite de tiempo con una acción simple (por ejemplo, \"pulse la barra de espacio\"), y el usuario tiene permitido extender el límite de tiempo de por lo menos diez veces; o"
                                        },
                                        {
                                            "handle": "De excepciones en tiempo Real",
                                            "text": "El límite de tiempo es una parte necesaria de eventos en tiempo real (por ejemplo, una subasta), y no hay alternativa para el límite de tiempo es posible; o"
                                        },
                                        {
                                            "handle": "Excepción",
                                            "text": "El límite de tiempo es esencial y la ampliación de invalidaría la actividad; o"
                                        },
                                        {
                                            "handle": "20 Horas De Excepción",
                                            "text": "El límite de tiempo es de más de 20 horas."
                                        }
                                    ]
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Este criterio de éxito ayuda a garantizar que los usuarios pueden completar las tareas sin inesperados cambios en el contenido o contexto en el que son el resultado de un límite de tiempo. Este criterio de éxito debe ser considerado conjuntamente con el Criterio de Éxito 3.2.1, que pone límites a los cambios de contenido o el contexto, como resultado de una acción del usuario."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:pause-stop-hide",
                            "alt_id": [
                                "time-limits-pause"
                            ],
                            "num": "2.2.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Poner en pausa, detener, ocultar",
                            "text": "Para el movimiento, parpadeo, el desplazamiento, o auto-actualización de la información, todos los siguientes son verdaderas:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "En movimiento, parpadeo, el desplazamiento",
                                            "text": "Para cualquier movimiento, parpadeo o el desplazamiento, la información que (1) se inicia automáticamente, (2) dura más de cinco segundos, y (3) se presenta en paralelo con otro contenido, no es un mecanismo para que el usuario pausar, detener, ocultar o menos el movimiento, parpadeo, o el desplazamiento, es parte de una actividad en la que es esencial; y"
                                        },
                                        {
                                            "handle": "Auto-actualización",
                                            "text": "Para cualquier auto-actualización de la información que (1) se inicia automáticamente y (2) se presenta en paralelo con otro contenido, no es un mecanismo para que el usuario pausar, detener, o se esconden o para el control de la frecuencia de la actualización a menos que la auto-actualización es parte de una actividad donde es esencial."
                                        }
                                    ]
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Para los requisitos relacionados con el parpadeo o intermitente de contenido, consulte la Directriz 2.3."
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 2",
                                    "text": "Ya que cualquier contenido que no cumpla con este criterio de éxito puede interferir con la capacidad del usuario para utilizar toda la página, todo el contenido de la página Web (tanto si se utiliza para cumplir con otros criterios de éxito o no) debe cumplir con este criterio de éxito. Vea Requisito De Conformidad 5: No Interferencia."
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 3",
                                    "text": "El contenido que se actualiza periódicamente por el software o que se transmite a los agentes de usuario no está obligado a preservar o presente la información que se genera o recibe entre el inicio de la pausa y reanudar la presentación, ya que esto puede no ser técnicamente posible, y en muchas situaciones puede ser engañosa para hacerlo."
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 4",
                                    "text": "Una animación que se produce como parte de una precarga de la fase o situación similar puede ser considerado esencial si la interacción no puede producirse durante la fase para todos los usuarios y, si no se indica el progreso podría confundir a los usuarios o hacer pensar que el contenido se ha congelado o roto."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:no-timing",
                            "alt_id": [
                                "time-limits-no-exceptions"
                            ],
                            "num": "2.2.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Sin Tiempo",
                            "text": "Tiempo no es una parte esencial del evento o de la actividad presentado por el contenido, excepto para los no-interactiva de medios sincronizada y en tiempo real de los eventos."
                        },
                        {
                            "id": "WCAG2:interruptions",
                            "alt_id": [
                                "time-limits-postponed"
                            ],
                            "num": "2.2.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Interrupciones",
                            "text": "Las interrupciones pueden ser pospuesto o suprimida por el usuario, salvo las interrupciones que incluye una emergencia."
                        },
                        {
                            "id": "WCAG2:re-authenticating",
                            "alt_id": [
                                "time-limits-server-timeout"
                            ],
                            "num": "2.2.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Re-autenticación",
                            "text": "Cuando una sesión autenticada expira, el usuario puede continuar la actividad sin pérdida de datos después de volver a autenticar."
                        },
                        {
                            "id": "WCAG2:timeouts",
                            "alt_id": [],
                            "num": "2.2.6",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Los tiempos de espera",
                            "text": "Se advierte a los usuarios de la duración de los periodos de inactividad del usuario que podría causar la pérdida de datos, a menos que los datos se conservan durante más de 20 horas, cuando el usuario no toma ninguna acción."
                        }
                    ]
                },
                {
                    "id": "WCAG2:seizures-and-physical-reactions",
                    "alt_id": [
                        "seizure"
                    ],
                    "num": "2.3",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Las convulsiones y Reacciones Físicas",
                    "text": "No diseñar contenido en una forma que se conoce para causar convulsiones o reacciones físicas.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:three-flashes-or-below-threshold",
                            "alt_id": [
                                "seizure-does-not-violate"
                            ],
                            "num": "2.3.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Umbral de tres destellos o menos",
                            "text": "Las páginas Web no contienen nada que parpadea más de tres veces en un segundo período, o el flash está por debajo de la general de flash y flash rojo umbrales.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Ya que cualquier contenido que no cumpla con este criterio de éxito puede interferir con la capacidad del usuario para utilizar toda la página, todo el contenido de la página Web (tanto si se utiliza para cumplir con otros criterios de éxito o no) debe cumplir con este criterio de éxito. Vea Requisito De Conformidad 5: No Interferencia."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:three-flashes",
                            "alt_id": [
                                "seizure-three-times"
                            ],
                            "num": "2.3.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Tres Destellos",
                            "text": "Las páginas Web no contienen nada que parpadea más de tres veces en un segundo período."
                        },
                        {
                            "id": "WCAG2:animation-from-interactions",
                            "alt_id": [],
                            "num": "2.3.3",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "La animación de las Interacciones",
                            "text": "Animación provocada por la interacción puede ser desactivado, a menos que la animación es esencial para la funcionalidad o la información que se transmite."
                        }
                    ]
                },
                {
                    "id": "WCAG2:navigable",
                    "alt_id": [
                        "navigation-mechanisms"
                    ],
                    "num": "2.4",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Navegable",
                    "text": "Proporcionar los medios para ayudar a los usuarios a navegar, encontrar contenido y determinar dónde se encuentran.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:bypass-blocks",
                            "alt_id": [
                                "navigation-mechanisms-skip"
                            ],
                            "num": "2.4.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Evitar bloques",
                            "text": "Un mecanismo para eludir los bloques de contenido que se repiten en múltiples páginas Web."
                        },
                        {
                            "id": "WCAG2:page-titled",
                            "alt_id": [
                                "navigation-mechanisms-title"
                            ],
                            "num": "2.4.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Titulado de  páginas",
                            "text": "Las páginas Web tienen títulos que describen el tema o propósito."
                        },
                        {
                            "id": "WCAG2:focus-order",
                            "alt_id": [
                                "navigation-mechanisms-focus-order"
                            ],
                            "num": "2.4.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Orden del foco",
                            "text": "Si una página Web se puede navegar de forma secuencial y las secuencias de navegación afectar el significado o la operación seleccionable de componentes de recibir el foco en un orden que preserva el significado y operatividad."
                        },
                        {
                            "id": "WCAG2:link-purpose-in-context",
                            "alt_id": [
                                "navigation-mechanisms-refs"
                            ],
                            "num": "2.4.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Propósito de los enlaces (en contexto)",
                            "text": "El objetivo de cada vínculo puede ser determinado desde el enlace de texto o desde el enlace de texto junto con su programación determinado enlace contexto, excepto cuando el propósito del enlace sería ambiguo para los usuarios en general."
                        },
                        {
                            "id": "WCAG2:multiple-ways",
                            "alt_id": [
                                "navigation-mechanisms-mult-loc"
                            ],
                            "num": "2.4.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Múltiples vías",
                            "text": "Más que una forma está disponible para localizar una página Web dentro de un conjunto de páginas Web, excepto cuando la Página Web es el resultado de, o un paso en un proceso."
                        },
                        {
                            "id": "WCAG2:headings-and-labels",
                            "alt_id": [
                                "navigation-mechanisms-descriptive"
                            ],
                            "num": "2.4.6",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Encabezados y etiquetas",
                            "text": "Los títulos y las etiquetas describen el tema o propósito.",
                            "sufficientNotes": [
                                "Los encabezados y etiquetas deben ser de programación determinado, por <a href='#contenido-estructura-separación-programático'>Criterio de Éxito 1.3.1</a>."
                            ]
                        },
                        {
                            "id": "WCAG2:focus-visible",
                            "alt_id": [
                                "navigation-mechanisms-focus-visible"
                            ],
                            "num": "2.4.7",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Foco visible",
                            "text": "Cualquier teclado operable de la interfaz de usuario tiene un modo de funcionamiento en el que el foco del teclado indicador está visible."
                        },
                        {
                            "id": "WCAG2:location",
                            "alt_id": [
                                "navigation-mechanisms-location"
                            ],
                            "num": "2.4.8",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Ubicación",
                            "text": "La información sobre la ubicación del usuario dentro de un conjunto de páginas Web está disponible."
                        },
                        {
                            "id": "WCAG2:link-purpose-link-only",
                            "alt_id": [
                                "navigation-mechanisms-link"
                            ],
                            "num": "2.4.9",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Link Propósito (Enlace Único)",
                            "text": "Un mecanismo para permitir que el propósito de cada enlace de ser identificados a partir link de solo texto, excepto cuando el propósito del enlace sería ambiguo para los usuarios en general."
                        },
                        {
                            "id": "WCAG2:section-headings",
                            "alt_id": [
                                "navigation-mechanisms-headings"
                            ],
                            "num": "2.4.10",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Encabezados De Sección",
                            "text": "Encabezados de sección se utilizan para organizar el contenido.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "\"Título\" se utiliza en su sentido general e incluye títulos y otras formas de añadir un título a diferentes tipos de contenido."
                                },
                                {
                                    "type": "nota",
                                    "handle": "Nota 2",
                                    "text": "Este criterio de éxito cubre las secciones dentro de la escritura, no de componentes de interfaz de usuario. Componentes de Interfaz de usuario están cubiertos bajo el Criterio de Éxito 4.1.2."
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:input-modalities",
                    "alt_id": [],
                    "num": "2.5",
                    "versions": [
                        "2.1"
                    ],
                    "handle": "De Entrada Modalidades",
                    "text": "Hacer que sea más fácil para los usuarios a utilizar la funcionalidad a través de diversos insumos, más allá de teclado.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:pointer-gestures",
                            "alt_id": [],
                            "num": "2.5.1",
                            "versions": [
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Gestos del puntero",
                            "text": "Toda la funcionalidad que utiliza multipunto o la ruta de acceso basado en gestos para la operación puede ser operado con una sola puntero sin una ruta basada en el gesto, a menos que multipunto o la ruta de acceso basado en gesto es esencial."
                        },
                        {
                            "id": "WCAG2:pointer-cancellation",
                            "alt_id": [],
                            "num": "2.5.2",
                            "versions": [
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Cancelación del puntero",
                            "text": "Para la funcionalidad que puede ser operado utilizando un único puntero, al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "No-Evento",
                                            "text": "El caso de que el puntero no se utiliza para ejecutar cualquier parte de la función;"
                                        },
                                        {
                                            "handle": "Anular o Deshacer",
                                            "text": "La finalización de la función en el evento, y un mecanismo para abortar la función antes de la finalización o deshacer la función después de la terminación;"
                                        },
                                        {
                                            "handle": "Hasta La Reversión",
                                            "text": "El evento se invierte cualquier resultado de la anterior hacia abajo-evento;"
                                        },
                                        {
                                            "handle": "Esencial",
                                            "text": "Completar la función en el evento es esencial."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:label-in-name",
                            "alt_id": [],
                            "num": "2.5.3",
                            "versions": [
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Etiqueta en el nombre",
                            "text": "Para los componentes de interfaz de usuario con las etiquetas de texto o las imágenes de texto, el nombre contiene el texto que se presenta visualmente."
                        },
                        {
                            "id": "WCAG2:motion-actuation",
                            "alt_id": [],
                            "num": "2.5.4",
                            "versions": [
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Activación mediante movimiento",
                            "text": "La funcionalidad que puede ser operado por el movimiento del dispositivo o de usuario de movimiento también puede ser operado por componentes de interfaz de usuario y responder a la moción puede ser desactivado para evitar el accionamiento accidental, excepto cuando:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Interfaz Compatible Con",
                                            "text": "El movimiento se utiliza para operar la funcionalidad a través de una de accesibilidad de la interfaz compatible;"
                                        },
                                        {
                                            "handle": "Esencial",
                                            "text": "El movimiento es esencial para la función y hacerlo invalidaría la actividad."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:target-size",
                            "alt_id": [],
                            "num": "2.5.5",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Tamaño De Destino",
                            "text": "El tamaño de la meta para el puntero de las entradas es de al menos 44 44 píxeles CSS, excepto cuando:",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Equivalente",
                                            "text": "El destino está disponible a través de un equivalente de enlace o control en la misma página que es de al menos 44 44 CSS píxeles;"
                                        },
                                        {
                                            "handle": "En línea",
                                            "text": "El objetivo está en una sentencia o bloque de texto;"
                                        },
                                        {
                                            "handle": "Agente De Usuario De Control De",
                                            "text": "El tamaño de la de destino es determinado por el agente de usuario y no es modificado por el autor;"
                                        },
                                        {
                                            "handle": "Esencial",
                                            "text": "En una presentación particular de la de destino es fundamental la información que se transmite."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:concurrent-input-mechanisms",
                            "alt_id": [],
                            "num": "2.5.6",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Concurrente Mecanismos De Entrada",
                            "text": "Contenido de la Web no restringir el uso de la entrada de las modalidades disponibles en una plataforma salvo cuando la restricción es esencial, necesario para garantizar la seguridad de los contenidos, ni obligados a respetar la configuración de usuario."
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:understandable",
            "num": "3",
            "versions": [
                "2.0",
                "2.1"
            ],
            "handle": "Comprensible",
            "text": "La información y el funcionamiento de la interfaz de usuario deben ser comprensibles.",
            "guidelines": [
                {
                    "id": "WCAG2:readable",
                    "alt_id": [
                        "meaning"
                    ],
                    "num": "3.1",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Legible",
                    "text": "Hacer que el contenido de texto legible y comprensible.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:language-of-page",
                            "alt_id": [
                                "meaning-doc-lang-id"
                            ],
                            "num": "3.1.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Idioma de la página",
                            "text": "El valor predeterminado del lenguaje humano, de cada página Web puede ser determinado mediante programación."
                        },
                        {
                            "id": "WCAG2:language-of-parts",
                            "alt_id": [
                                "meaning-other-lang-id"
                            ],
                            "num": "3.1.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Idioma de las partes",
                            "text": "El lenguaje humano de cada pasaje o frase en el contenido puede ser determinado mediante programación, excepto para los nombres propios, términos técnicos, palabras de indeterminado lenguaje, y las palabras o frases que se han convertido en parte de la lengua vernácula de la inmediatamente el texto que lo rodea."
                        },
                        {
                            "id": "WCAG2:unusual-words",
                            "alt_id": [
                                "meaning-idioms"
                            ],
                            "num": "3.1.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Palabras Inusuales",
                            "text": "Un mecanismo para la identificación específica de las definiciones de palabras o frases que se utilizan en un inusual o limitada, incluyendo modismos y jerga."
                        },
                        {
                            "id": "WCAG2:abbreviations",
                            "alt_id": [
                                "meaning-located"
                            ],
                            "num": "3.1.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Abreviaturas",
                            "text": "Un mecanismo para la identificación de la forma expandida o el significado de las abreviaturas está disponible."
                        },
                        {
                            "id": "WCAG2:reading-level",
                            "alt_id": [
                                "meaning-supplements"
                            ],
                            "num": "3.1.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Nivel De Lectura",
                            "text": "Cuando el texto se requiere de la capacidad de lectura más avanzado que el de menor nivel de educación secundaria después de la eliminación de los nombres propios y títulos, contenido adicional, o una versión que no requiere de la capacidad de lectura más avanzado que el de menor nivel de educación secundaria, está disponible.",
                            "sufficientNotes": [
                                "Diferentes sitios de mayo de dirección de este Criterio de Éxito de diferentes maneras. Una versión en audio del contenido puede ser útil para algunos usuarios. Para algunas personas que son sordas, una versión en lenguaje de signos de la página puede ser más fácil de comprender que el lenguaje escrito, versión, ya que la lengua de señas puede ser su primer idioma. Algunos sitios pueden decidir hacer ambas cosas u otras combinaciones. Una técnica que ayudará a todos los usuarios que tienen dificultad. Tan diferentes técnicas se proporcionan suficiente de las técnicas aquí para los autores, tratando de hacer que sus sitios sean más accesibles. Cualquier numeradas de la técnica o la combinación puede ser utilizada por un sitio en particular y es considerada suficiente por el Grupo de Trabajo."
                            ]
                        },
                        {
                            "id": "WCAG2:pronunciation",
                            "alt_id": [
                                "meaning-pronunciation"
                            ],
                            "num": "3.1.6",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Pronunciación",
                            "text": "Un mecanismo para identificar la pronunciación de palabras donde el significado de las palabras, en el contexto, es ambiguo, sin saber la pronunciación."
                        }
                    ]
                },
                {
                    "id": "WCAG2:predictable",
                    "alt_id": [
                        "consistent-behavior"
                    ],
                    "num": "3.2",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Predecible",
                    "text": "Hacer que las páginas Web aparezcan y operen de manera predecible.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:on-focus",
                            "alt_id": [
                                "consistent-behavior-receive-focus"
                            ],
                            "num": "3.2.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Al recibir el foco",
                            "text": "Cuando cualquier componente recibe el foco, no iniciar un cambio de contexto.",
                            "sufficientNotes": [
                                "Un cambio de contenido no es siempre un cambio de contexto. Este criterio de éxito es automáticamente se reunió si los cambios en los contenidos no son también los cambios de contexto."
                            ]
                        },
                        {
                            "id": "WCAG2:on-input",
                            "alt_id": [
                                "consistent-behavior-unpredictable-change"
                            ],
                            "num": "3.2.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Al recibir entradas",
                            "text": "Cambiar la configuración de cualquier componente de interfaz de usuario no causa automáticamente un cambio de contexto a menos que el usuario haya sido advertido de la conducta antes de utilizar el componente.",
                            "sufficientNotes": [
                                "Un cambio de contenido no es siempre un cambio de contexto. Este criterio de éxito es automáticamente se reunió si los cambios en los contenidos no son también los cambios de contexto."
                            ]
                        },
                        {
                            "id": "WCAG2:consistent-navigation",
                            "alt_id": [
                                "consistent-behavior-consistent-locations"
                            ],
                            "num": "3.2.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Navegación coherente",
                            "text": "De navegación de los mecanismos que se repiten en múltiples páginas Web dentro de un conjunto de páginas Web se producen en el mismo orden relativo que cada vez que se repite, a menos que el cambio es iniciado por el usuario."
                        },
                        {
                            "id": "WCAG2:consistent-identification",
                            "alt_id": [
                                "consistent-behavior-consistent-functionality"
                            ],
                            "num": "3.2.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Identificación coherente",
                            "text": "Los componentes que tienen la misma funcionalidad dentro de un conjunto de páginas Web se identifican de forma coherente.",
                            "sufficientNotes": [
                                "Alternativas de texto que son \"consistentes\", no siempre son \"idénticos\". Por ejemplo, usted puede tener una gráfica de flecha en la parte inferior de una página Web que enlace a la siguiente página Web. El texto alternativo puede decir \"Ir a la página 4.\" Naturalmente, no sería conveniente repetir este texto exacto alternativa en la siguiente página Web. Sería más apropiado decir \"Ir a la página 5\". Aunque estas alternativas de texto no sería idéntico, que sea consistente, y por lo tanto satisfacer este Criterio de Éxito.",
                                "Una sola no-texto-contenido-objeto puede ser utilizado para servir a diferentes funciones. En tales casos, las diferentes alternativas de texto son necesarios y deben ser utilizados. Ejemplos pueden ser encontrados comúnmente con el uso de iconos, tales como marcas de verificación, cruz marcas y señales de tráfico. Sus funciones pueden ser diferentes dependiendo del contexto de la página Web. Un icono de marca de verificación puede funcionar como \"aprobado\", \"terminada\", o \"incluido\", para nombrar unos pocos, dependiendo de la situación. El uso de \"marca de verificación\" como texto alternativo en todas las páginas Web no ayuda a los usuarios a comprender la función del icono. Diferentes alternativas de texto puede ser utilizado cuando el mismo contenido no textual que sirve para múltiples funciones."
                            ]
                        },
                        {
                            "id": "WCAG2:change-on-request",
                            "alt_id": [
                                "consistent-behavior-no-extreme-changes-context"
                            ],
                            "num": "3.2.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Cambio en la Solicitud de",
                            "text": "Los cambios de contexto se inicia por solicitud del usuario o de un mecanismo para desactivar dichos cambios."
                        }
                    ]
                },
                {
                    "id": "WCAG2:input-assistance",
                    "alt_id": [
                        "minimize-error"
                    ],
                    "num": "3.3",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "La Entrada De Ayuda",
                    "text": "Ayudar a los usuarios a evitar y corregir errores.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:error-identification",
                            "alt_id": [
                                "minimize-error-identified"
                            ],
                            "num": "3.3.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Identificación de errores",
                            "text": "Si una entrada de error es detectado automáticamente, el elemento que está en el error es identificado y el error se describe para el usuario en el texto."
                        },
                        {
                            "id": "WCAG2:labels-or-instructions",
                            "alt_id": [
                                "minimize-error-cues"
                            ],
                            "num": "3.3.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Etiquetas o instrucciones",
                            "text": "Las etiquetas o instrucciones que se proporcionan cuando el contenido requiere la intervención del usuario.",
                            "sufficientNotes": [
                                "Las técnicas al final de la lista anterior debe ser considerado como \"último recurso\" y sólo se utilizan cuando las otras técnicas no pueden ser aplicados a la página. Las anteriores técnicas son las preferidas porque a aumentar la accesibilidad a un amplio grupo de usuarios."
                            ]
                        },
                        {
                            "id": "WCAG2:error-suggestion",
                            "alt_id": [
                                "minimize-error-suggestions"
                            ],
                            "num": "3.3.3",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Sugerencias ante errores",
                            "text": "Si un error de entrada se detecta automáticamente y sugerencias para la corrección son conocidos, entonces las sugerencias que se proporcionan al usuario, a menos que se pusiera en peligro la seguridad o uso de los contenidos."
                        },
                        {
                            "id": "WCAG2:error-prevention-legal-financial-data",
                            "alt_id": [
                                "minimize-error-reversible"
                            ],
                            "num": "3.3.4",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Prevención de errores (legales, financieros, datos)",
                            "text": "Para las páginas Web que causa legal de los compromisos o de las transacciones financieras para el usuario a ocurrir, que modificar o eliminar el usuario-controlable de datos en sistemas de almacenamiento de datos, o que envíe el usuario las respuestas en la prueba, al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversible",
                                            "text": "Los envíos son reversibles."
                                        },
                                        {
                                            "handle": "Comprobado",
                                            "text": "Los datos introducidos por el usuario está marcada por los errores de entrada de datos y el usuario se proporciona una oportunidad para que los corrija."
                                        },
                                        {
                                            "handle": "Confirmado",
                                            "text": "Un mecanismo para revisar, confirmar y corregir la información antes de finalizar la presentación."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:help",
                            "alt_id": [
                                "minimize-error-context-help"
                            ],
                            "num": "3.3.5",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Ayuda",
                            "text": "Ayuda sensible al contexto está disponible."
                        },
                        {
                            "id": "WCAG2:error-prevention-all",
                            "alt_id": [
                                "minimize-error-reversible-all"
                            ],
                            "num": "3.3.6",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "AAA",
                            "handle": "Prevención De Errores (Todos)",
                            "text": "Para las páginas Web que requieren que el usuario envíe información, al menos uno de los siguientes es verdadera:",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversible",
                                            "text": "Los envíos son reversibles."
                                        },
                                        {
                                            "handle": "Comprobado",
                                            "text": "Los datos introducidos por el usuario está marcada por los errores de entrada de datos y el usuario se proporciona una oportunidad para que los corrija."
                                        },
                                        {
                                            "handle": "Confirmado",
                                            "text": "Un mecanismo para revisar, confirmar y corregir la información antes de finalizar la presentación."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:robust",
            "num": "4",
            "versions": [
                "2.0",
                "2.1"
            ],
            "handle": "Robusto",
            "text": "El contenido debe ser suficientemente robusto que puede interpretarse de forma fiable por una amplia variedad de agentes de usuario, incluidas las tecnologías de asistencia.",
            "guidelines": [
                {
                    "id": "WCAG2:compatible",
                    "alt_id": [
                        "ensure-compat"
                    ],
                    "num": "4.1",
                    "versions": [
                        "2.0",
                        "2.1"
                    ],
                    "handle": "Compatible",
                    "text": "Maximizar la compatibilidad con las actuales y futuras de los agentes de usuario, incluidas las tecnologías de asistencia.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:parsing",
                            "alt_id": [
                                "ensure-compat-parses"
                            ],
                            "num": "4.1.1",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Procesamiento",
                            "text": "En el contenido de implementado el uso de lenguajes de marcado, los elementos tienen completa de etiquetas de inicio y fin, los elementos anidados de acuerdo a sus especificaciones, los elementos no contienen atributos duplicados, y cualquier Identificadores son únicos, excepto donde las especificaciones permiten que estas características.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Etiquetas de inicio y fin que faltan un carácter crítico en su formación, como un paréntesis angular de cierre o un mal valor del atributo comillas no están completas."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:name-role-value",
                            "alt_id": [
                                "ensure-compat-rsv"
                            ],
                            "num": "4.1.2",
                            "versions": [
                                "2.0",
                                "2.1"
                            ],
                            "level": "A",
                            "handle": "Nombre, función, valor",
                            "text": "Para todos los componentes de interfaz de usuario (incluyendo pero no limitado a: los elementos de los formularios, enlaces y componentes generados por scripts), el nombre y la función puede ser determinado mediante programación; los estados, propiedades y valores que se pueden configurar por el usuario se puede establecer mediante programación; y la notificación de los cambios a estos elementos está disponible para los agentes de usuario, incluidas las tecnologías de asistencia.",
                            "details": [
                                {
                                    "type": "nota",
                                    "handle": "Nota 1",
                                    "text": "Este criterio de éxito es principalmente para la Web de los autores que desarrollan la secuencia de comandos o de sus propios componentes de interfaz de usuario. Por ejemplo, los controles HTML estándar ya cumplen con este criterio de éxito cuando se utiliza de acuerdo a las especificaciones."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:status-messages",
                            "alt_id": [],
                            "num": "4.1.3",
                            "versions": [
                                "2.1"
                            ],
                            "level": "AA",
                            "handle": "Mensajes de estado",
                            "text": "En el contenido de implementado el uso de lenguajes de marcado, los mensajes de estado puede ser determinado mediante programación a través de roles o propiedades que pueden ser presentados al usuario a través de las tecnologías de asistencia sin recibir el foco."
                        }
                    ]
                }
            ]
        }
    ]
}
