#1.1.1 Alternativas

#Imágenes con atributo alt 
check.1.error = Imagen sin alternativa.
check.1.rationale = <p>Todas las imagenes deben tener texto alternativo. Es necesario para los usuarios que no son capaces de ver la imagen.</p>

#Elementos area con atributo alt (puede ser vacío) 
check.64.error = No hay alternativa en las \u00E1reas del mapa de imagen.
check.64.rationale = <p>Todos los elementos no textuales deben tener un texto alternativo que permita el acceso a la informaci\u00F3n que contienen para usuarios que no pueda visualizar el elemento.</p>
#Imágenes con atributo alt sospechoso 
check.100.error = Existen im\u00E1genes cuyo atributo <code>alt</code> contiene un texto de relleno.
check.100.rationale = <p>Proporcione alternativas adecuadas a las im\u00E1genes dependiendo de su funcionalidad. Si son decorativas utilice un atributo <code>alt</code> vac\u00EDo o con un espacio en blanco y si son im\u00E1genes que transmiten informaci\u00F3n describa esa misma informaci\u00F3n textualmente en el atributo <code>alt</code>.</p>
#Elementos area pinchables con atributo alt no vacío 
check.157.error = Se ha encontrado un elemento <code>area</code> con atributo <code>href</code> definido, pero que no especifica el destino del enlace mediante el atributo <code>alt</code>.
check.157.rationale = <p>Las \u00E1reas definidas en un mapa de imagen act\u00FAan como enlaces cuando tienen definido el atributo <code>href</code>, actuando el texto alternativo del \u00E1rea como texto del enlace. Por lo tanto se debe proporcionar en el atributo <code>alt</code> del elemento <code>AREA</code> un texto que describa el destino del enlace.</p>
#Longdesc válido 
check.278.error = No se indica una URL v\u00E1lida en el atributo <code>longdesc</code>.
check.278.rationale = <p>Las im\u00E1genes complejas requieren de una explicaci\u00F3n detallada en la que se indique toda la informaci\u00F3n que se trasmite a trav\u00E9s de la imagen. Esta descripci\u00F3n podr\u00E1 incluirse en un documento XHTML o en la misma p\u00E1gina donde se encuentra la imagen. La URL que apunta al comienzo de la descripci\u00F3n se indica en el atributo <code>longdesc</code> de la imagen.</p><p>Los mapas de situaci\u00F3n, los gr\u00E1ficos, f\u00F3rmulas, organigramas, etc. son tipolog\u00EDas de im\u00E1genes que necesitan una descripci\u00F3n larga.</p><p>En las im\u00E1genes listadas a continuaci\u00F3n no se indica una URL v\u00E1lida en la que se encuentra el comienzo de su descripci\u00F3n detallada.</p>
#Input type image con alternativas 
check.306.error = Elemento input de tipo imagen sin alternativa.
check.306.rationale = <p>Cuando se utiliza un input de tipo imagen se debe emplear el atributo <code>alt</code> para proporcionar una etiqueta. El texto de este atributo debe describir la funcionalidad del bot\u00F3n, en lugar de describir la imagen.</p>
#Imágenes decorativas (alt blank) sin atributo title 
check.413.error = Im\u00E1genes decorativas que no son transparentes para los usuarios.
check.413.rationale = <p>Las im\u00E1genes con fines decorativos, que no aportan informaci\u00F3n, deben ser transparentes para los usuarios de lectores de pantalla. Es decir, los lectores de pantalla deben poder ignorarlas para que no entorpezcan la lectura de la p\u00E1gina. Para ello deben tener un texto alternativo vac\u00EDo (<code>alt=""</code>), carecer de un t\u00EDtulo y, en caso de emplear WAI-ARIA, su <code>role</code> s\u00F3lo pueden tener valor "presentation".</p>
#Applets sin alternativas (atributo alt o descripción en el cuerpo applet) 
check.414.error = Existen elementos <code>APPLET</code> que carecen de alternativa textual.
check.414.rationale = <p>Todos los elementos <code>APPLET</code> deben tener una alternativa textual que est\u00E9 disponible para las aplicaciones de usuario que no soporten dicha tecnolog\u00EDa. La alternativa textual se ha de proporcionar mediante el atributo <code>alt</code> y tambi\u00E9n en forma de contenido textual dentro de las etiquetas de apertura y de cierre del elemento <code>APPLET</code>.</p>
#Imágenes menores a X*Y deben ser decorativas (alt blank, no title, role=presentation) 
check.426.error = Presencia de im\u00E1genes decorativas (posiblemente espaciadores o separadores) que no son transparentes para los usuarios lectores de pantalla.
check.426.rationale = <p>Las im\u00E1genes que se empleen con fines \u00FAnicamente decorativos deben ser trasparentes para los usuarios de lectores de pantalla. Es decir, los usuarios no deben percibir su presencia. Para ello estas im\u00E1genes deben tener un texto alternativo vac\u00EDo (<code>alt=""</code>) y carecer de un t\u00EDtulo. En caso de emplear WAI-ARIA el \u00FAnico <code>role</code> permitido es <code>presentation</code> para indicar que se trata de im\u00E1genes decorativas.</p>


#1.1.2 Uso de encabezados

#Anidación correcta de encabezados 
check.37.error = Se saltan niveles de encabezado.
check.37.rationale = <p>Los documentos Web se dividen en secciones para las cuales se debe proporcionar un t\u00EDtulo que identifique su contenido mediante elementos HTML de encabezado (<code>H1</code>...<code>H6</code>). Los diferentes niveles de encabezado (1...6) empleados en cada secci\u00F3n, deben identificar la dependencia jer\u00E1rquica entre las distintas secciones en que se divide la p\u00E1gina.</p><p>La estructura de encabezados se debe corresponder con la estructura l\u00F3gica de la p\u00E1gina, de forma que no se produzcan saltos de nivel y no se utilicen para crear efectos de presentaci\u00F3n. En todas las p\u00E1ginas debe aparecer al menos un encabezado de primer nivel (<code>H1</code>).</p><p>Los encabezados resultan de gran ayuda en la navegaci\u00F3n ya que permiten acceder de forma r\u00E1pida a las distintas secciones que componen una p\u00E1gina Web.</p><p>Se producen saltos de niveles en los encabezados, cuesti\u00F3n que debe ser solventada.</p>
#Existencia de encabezado H1 
check.421.error = Inexistencia de encabezado <code>H1</code>.
check.421.rationale = <p>En todas las p\u00E1ginas debe haber al menos un encabezado de nivel <code>H1</code> que se corresponda con el t\u00EDtulo principal del contenido de la p\u00E1gina.</p>
#Existencia de encabezados 
check.38.error = No se utilizan elementos de encabezado.
check.38.rationale = <p>Los documentos Web se dividen en secciones para las cuales se debe proporcionar un t\u00EDtulo que identifique su contenido mediante elementos HTML de encabezado (<code>H1</code>...<code>H6</code>). Los diferentes niveles de encabezado (1...6) empleados en cada secci\u00F3n, deben identificar la dependencia jer\u00E1rquica entre las distintas secciones en que se divide la p\u00E1gina.</p><p>La estructura de encabezados se debe corresponder con la estructura l\u00F3gica de la p\u00E1gina, de forma que no se produzcan saltos de nivel y no se utilicen para crear efectos de presentaci\u00F3n. En todas las p\u00E1ginas debe aparecer al menos un encabezado de primer nivel (<code>H1</code>).</p><p>Los encabezados resultan de gran ayuda en la navegaci\u00F3n ya que permiten acceder de forma r\u00E1pida a las distintas secciones que componen una p\u00E1gina Web.</p>
#Encabezados vacios 
check.395.error = Existen encabezados sin texto.
check.395.rationale = <p>Los documentos Web se dividen en secciones para las cuales se debe proporcionar un t\u00EDtulo que identifique su contenido mediante elementos HTML de encabezado (H1...H6). Los diferentes niveles de encabezado (1...6) empleados en cada secci\u00F3n, deben identificar la dependencia jer\u00E1rquica entre las distintas secciones en que se divide la p\u00E1gina.</p><p>La estructura de encabezados se debe corresponder con la estructura l\u00F3gica de la p\u00E1gina, de forma que no se produzcan saltos de nivel y no se utilicen para crear efectos de presentaci\u00F3n. En todas las p\u00E1ginas debe aparecer al menos un encabezado de primer nivel (H1).</p><p>Los encabezados resultan de gran ayuda en la navegaci\u00F3n ya que permiten acceder de forma r\u00E1pida a las distintas secciones que componen una p\u00E1gina Web.</p>
#Encabezados mismo nivel con mismo texto 
check.141.error = Hay dos o m\u00E1s encabezados seguidos del mismo nivel con el mismo texto.
check.141.rationale= Hay dos o m\u00E1s encabezados seguidos del mismo nivel con el mismo texto.
#Encabezados mismo nivel seguidos sin contenido
check.422.error = Presencia de encabezados seguidos del mismo nivel (o superior) sin contenido entre ellos.
check.422.rationale = <p>Debe existir contenido textual entre un encabezado y el siguiente encabezado cuando este \u00FAltimo es del mismo nivel o de un nivel superior que el encabezado anterior. Por ejemplo, debe existir contenido entre secuencias de encabezados del tipo (<code>H2, H2</code>) o (<code>H2, H1</code>). Si un encabezado no tiene un contenido al que encabezar entonces carece de sentido la existencia de dicho encabezado.</p>
#Más de un encabezado si hay más de 15 párrafos 
check.433.error = Escasez de encabezados para estructurar el contenido.
check.433.rationale = <p>En contenidos extensos se ha de prestar especial atenci\u00F3n a organizar y estructurar dicho contenido en diferentes secciones usando los elementos de encabezado para indicar el t\u00EDtulo de cada secci\u00F3n con el fin de facilitar la lectura y comprensi\u00F3n del contenido. Emplear un \u00FAnico encabezado principal puede ser insuficiente en la mayor\u00EDa de las ocasaciones.</p>

#1.1.3 Uso de listas

#Listas ordenadas mal creadas con elementos p 
check.101.error = Se est\u00E1n simulando listas ordenadas mediante el uso de p\u00E1rrafos que comienzan por n\u00FAmeros, en lugar de usar el elemento de listas <code>OL</code>.
check.101.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p>
#Listas no ordenadas mal creadas con elementos p
check.120.error = Se est\u00E1n simulando listas no ordenadas mediante el uso de p\u00E1rrafos que comienzan por caracteres como "-" o "*", en lugar de usar el elemento de listas <code>UL</code>.
check.120.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p>
#Listas no ordeandas mal creadas con elementos br 
check.121.error = Se est\u00E1n simulando listas no ordenadas mediante el uso de saltos de l\u00EDnea que comienzan por caracteres como "-" o "*", en lugar de usar el elemento de listas <code>UL</code>.
check.121.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p>
#Listas ordenadas mal creadas con elementos br 
check.410.error = Se est\u00E1n simulando listas ordenadas mediante el uso de saltos de l\u00EDnea que comienzan por n\u00FAmeros, en lugar de usar el elemento de listas <code>OL</code>.
check.410.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p>
#Elemento de lista (li) fuera de contenedor (ul, ol) 
check.311.error = Elemento <code>li</code> de lista empleado fuera de enumeraciones.
check.311.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p><p>Se ha detectado el empleo de elementos de lista fuera de enumeraciones. Se debe eliminar dicho elementos o incluirlos en una estructura de lista.</p>
#Lista de definicion (dl) mal construida 
check.427.error = Estructura incorrecta en listas de definici\u00F3n.
check.427.rationale = <p>En caso de emplear listas de definici\u00F3n \u00E9stas han de seguir una estructura correcta. Es decir, cada elemento <code>DL</code> debe contener al menos un elemento <code>DT</code> y al menos un elemento <code>DD</code>, debiendo ser el primero un <code>DT</code> y el \u00FAltimo un <code>DD</code>.</p>
#Elemento de lista de definicion (dt) fuera de contenedor (dl) 
check.313.error = Elemento <code>dt</code> de lista empleado fuera de enumeraciones.
check.313.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p><p>Se ha detectado el empleo de elementos de lista fuera de enumeraciones. Se debe eliminar dicho elementos o incluirlos en una estructura de lista.</p>
#Elemento de lista de definicion (dd) fuera de contenedor (dl) 
check.314.error = Elemento <code>dd</code> de lista empleado fuera de enumeraciones.
check.314.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p><p>Se ha detectado el empleo de elementos de lista fuera de enumeraciones. Se debe eliminar dicho elementos o incluirlos en una estructura de lista.</p>
#Lista anidada directamente en lista ordenada (ol), no dentro de li 
check.317.error = Anidamiento de listas ordenadas mal construido.
check.317.rationale = <p>Cuando se realiza anidaci\u00F3n de listas, \u00E9sta se debe realizar en el interior del elemento de la lista padre, es decir, toda la lista anidada se debe incluir dentro del elemento de lista (<code>LI</code>).</p><p>En las listas mostradas a continuaci\u00F3n no se realiza adecuadamente la anidaci\u00F3n, por lo que deben ser revisadas.</p>
#Lista anidada directamente en lista no ordenada (ul), no dentro de li 
check.318.error = Anidamiento de listas no ordenadas mal construido.
check.318.rationale = <p>Cuando se realiza anidaci\u00F3n de listas, \u00E9sta se debe realizar en el interior del elemento de la lista padre, es decir, toda la lista anidada se debe incluir dentro del elemento de lista (<code>LI</code>).</p><p>En las listas mostradas a continuaci\u00F3n no se realiza adecuadamente la anidaci\u00F3n, por lo que deben ser revisadas.</p>
#Lista ordenada mal construida 
check.319.error = Lista ordenada mal construida.
check.319.rationale =  <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p><p>Las listas ordenadas, se definen por los elementos <code>ol</code> y <code>li</code>, que siempre deben aparecer.</p><p>En las listas mostradas a continuaci\u00F3n no se emplean alguno de los elementos necesarios por lo que deben ser revisadas para incluir todos los elementos necesarios o para sustituirlas por otra estructura distinta.</p>
#Lista no ordenada mal construida
check.320.error = Lista no ordenada mal construida.
check.320.rationale = <p>Las enumeraciones de elementos deben estructurarse adecuadamente mediante los elementos HTML de lista en lugar de representarlas como tal \u00FAnicamente de forma visual, as\u00ED sus elementos ser\u00E1n identificables por todos los agentes de usuario. No se debe utilizar los elementos de lista para crear efectos de presentaci\u00F3n.</p><p>Las listas sin orden, se definen por los elementos <code>ul</code> y <code>li</code>, que siempre deben aparecer.</p><p>En las listas mostradas a continuaci\u00F3n no se emplean alguno de los elementos necesarios por lo que deben ser revisadas para incluir todos los elementos necesarios o para sustituirlas por otra estructura distinta.</p>
#Lista ordenada vacía (sin ítems li) 
check.423.error = Presencia de listas ordenadas vac\u00EDas.
check.423.rationale = <p>No deben emplearse elementos de lista que carezcan de items. Si en un momento dado una lista carece de items en lugar de mostrarse como una lista sin elementos hijos (sin elementos <li>) deber\u00E1 eliminarse de la p\u00E1gina.</p>
#Lista no ordenada vacía (sin ítems li) 
check.424.error = Presencia de listas no ordenadas vac\u00EDas.
check.424.rationale = <p>No deben emplearse elementos de lista que carezcan de items. Si en un momento dado una lista carece de items en lugar de mostrarse como una lista sin elementos hijos (sin elementos <li>) deber\u00E1 eliminarse de la p\u00E1gina.</p>
#Lista de definición ordenada vacía (sin ítems dt, dd) 
check.425.error = Presencia de listas de definici\u00F3n vac\u00EDas.
check.425.rationale = <p>No deben emplearse elementos de lista que carezcan de items. Si en un momento dado una lista carece de items en lugar de mostrarse como una lista sin elementos hijos (sin elementos <dt> ni <dd>) deber\u00E1 eliminarse de la p\u00E1gina.</p>
#Lista ordenada simulada con lista no ordenada 
check.416.error = Simulaci\u00F3n de listas ordenadas mediante listas desordenadas y una numeraci\u00F3n.
check.416.rationale = <p>Las listas ordenadas se deben marcar con los elementos estructurales y sem\u00E1nticos adecuados. Debe emplearse por tanto el elemento <code>OL</code> en lugar de emplear listas desordenadas (<code>UL</code>) que comiencen por n\u00FAmeros o letras consecutivas.</p>
#3 o más párrafos seguidos que empiecen por una imagen cuyas dimensiones sean iguales o inferiores a X*Y (Heurístico X=10, Y=10).
check.445.error = Listas simuladas mediante varios p\u00E1rrafos e im\u00E1genes usadas como vi\u00F1etas de lista.
check.445.rationale = <p>Cuando un contenido se trata de un listado de elementos entonces debe emplearse el marcado adecuado para listas (<code>UL</code>, <code>OL</code> o <code>DL</code>) en lugar de simular dichas listas mediante el empleo de im\u00E1genes a modo de vi\u00F1etas situadas al comienzo de p\u00E1rrafos o saltos de l\u00EDnea.</p>
#3 o más líneas separadas por BR que empiecen por una imagen cuyas dimensiones sean iguales o inferiores a X*Y (Heurístico X=10, Y=10).
check.459.error = Listas simuladas mediante saltos de l\u00EDnea e im\u00E1genes usadas como vi\u00F1etas de lista.
check.459.rationale = <p>Cuando un contenido se trata de un listado de elementos entonces debe emplearse el marcado adecuado para listas (<code>UL</code>, <code>OL</code> o <code>DL</code>) en lugar de simular dichas listas mediante el empleo de im\u00E1genes a modo de vi\u00F1etas situadas al comienzo de p\u00E1rrafos o saltos de l\u00EDnea.</p>
#Tablas formadas por una única columna y 3 o más filas y que las celdas no superen los X caracteres (Heurístico X=150) 
check.431.error = Listados de elementos maquetados mediante tablas de una \u00FAnica columna en lugar de mediante listas.
check.431.rationale = <p>Cuando se muestre un listado de elementos se han de usar los elementos de lista adecuados para tal fin (<code>UL, OL</code> o <code>DL</code>) en lugar de emplear estructuras menos adecuadas como tablas de datos de una \u00FAnica columna. La informaci\u00F3n se considera tabular cuando las relaciones l\u00F3gicas entre los datos existen en dos dimensiones (vertical y horizontal). Si una tabla s\u00F3lo tiene una columna de datos entonces, por definici\u00F3n, no contiene informaci\u00F3n tabular y se ha de considerar como un simple listado.</p>


#1.1.4 Uso de Tablas

#Tabla de datos sin encabezados 
check.7.error = Comprobar que no se emplea la tabla para maquetar contenido.
check.7.rationale = <p>Se debe utilizar hojas de estilo para realizar la maquetaci\u00F3n y presentaci\u00F3n de los contenidos. Cuando sea necesario utilizar una tabla para maquetar, debe cumplir con la premisa de que la informaci\u00F3n que contiene debe tener sentido al leer las celdas de forma lineal en el orden en que aparecen en el documento.</p><p>No obstante el empleo de tablas de maquetaci\u00F3n aunque cumplan la premisa anterior, es una pr\u00E1ctica nada recomendable ya que dificulta enormemente la navegaci\u00F3n por la p\u00E1gina a un elevado n\u00FAmero de usuarios.</p><p>Se debe comprobar si las tablas de datos listadas a continuaci\u00F3n se emplean para maquetar contenido. En caso afirmativo se debe comprobar que cumplan con la premisa anterior. No obstante, es muy recomendable proceder a su eliminaci\u00F3n y sustituci\u00F3n por una maquetaci\u00F3n a trav\u00E9s de hojas de estilo.</p>
#Tabla de datos sin encabezados 
check.86.error = Se han encontrado tablas de datos en las que no se marca ning\u00FAn encabezado mediante el elemento <code>TH</code>.
check.86.rationale = <p>En las tablas de datos se deben identificar los encabezados de fila y/o columna, a trav\u00E9s del elemento <code>TH</code>.</p>
#Encabezamientos de tabla correctos 
check.116.error = Existen tablas de datos en las que no se marcan correctamente todos los encabezados.
check.116.rationale = <p>Es fundamental realizar un marcado adecuado de todos los encabezados en las tablas de datos de forma que la informaci\u00F3n sobre la relaci\u00F3n entre las celdas se pueda transmitir correctamente a los agentes de usuario.</p>
#Todas las tablas de datos contienen un elemento caption a menos que la tabla esté identificada en el documento. 
check.151.error = No se proporciona un resumen a la tabla de datos a trav\u00E9s del elemento <code>CAPTION</code> o el atributo <code>summary</code>.
check.151.rationale = <p>Los res\u00FAmenes son especialmente \u00FAtiles para los lectores no videntes. Un resumen de las relaciones entre las celdas es especialmente importante para las tablas con encabezamientos anidados, celdas que ocupan varias columnas o filas, u otras relaciones que no sean evidentes en un an\u00E1lisis de la estructura de la tabla, pero que s\u00ED se aprecian cuando la tabla se muestra visualmente. Un resumen tambi\u00E9n puede describir como una tabla encaja en el contexto del documento actual. Si no se proporciona ning\u00FAn t\u00EDtulo es mas importante a\u00FAn proporcionar un resumen.</p>
#Celdas únicas que ocupan el ancho completo de la tabla para simular encabezamientos 
check.156.error = Se simula el t\u00EDtulo de una tabla de datos empleando una \u00FAnica celda en la primera fila, en lugar de utilizar el elemento <code>CAPTION</code>.
check.156.rationale = <p>Es una mala pr\u00E1ctica habitual utilizar la primera fila de una tabla de datos para simular el t\u00EDtulo de la misma. Para ello se debe usar el elemento de HTML destinado a ese fin.</p>
#Ningún th está vacío. 
check.159.error = Se ha encontrado un elemento de encabezado <code>TH</code> vac\u00EDo.
check.159.rationale = <p>Las celdas de encabezado de una tabla proporcionan informaci\u00F3n sobre los datos contenidos en la tabla, por lo que su contenido no deber\u00EDa ser vac\u00EDo.</p>
#Las tablas de datos que contienen más de una fila/columna de cabeceras usan los atributos id y headers para identificar las celdas. 
check.245.error = Existen tablas complejas en las que no se marcan todos los encabezados, o no se asocian los encabezados y las celdas de datos mediante el marcado HTML correspondiente.
check.245.rationale = <p>En las tablas de datos complejas se debe asociar las celdas de datos con sus encabezados utilizando para ello los atributos <code>id</code> y <code>headers</code>. De esta forma los productos de apoyo podr\u00E1n presentar dichas tablas al usuario adecuadamente.<p>Esta asociaci\u00F3n se realiza de tal forma que cada celda de datos incluya en su atributo headers el identificador un\u00EDvoco (<code>id</code>) de cada uno de los encabezados relacionados con ella.</p><p>Las tablas listadas a continuaci\u00F3n precisan, por su complejidad, de una asociaci\u00F3n entre las celdas de datos y cada uno de sus encabezados.</p>
#Las tablas de datos que contienen más de una fila/columna de cabeceras presentan summary.
check.418.error = Ausencia de informaci\u00F3n de resumen (atributo <code>summary</code>) en tablas de datos complejas.
check.418.rationale = <p>Las tablas complejas que tienen encabezados tanto de fila como de columna y adem\u00E1s tienen dos o m\u00E1s filas o columnas de encabezado deben proporcionar una informaci\u00F3n de resumen que explique la estructura general de la tabla en el atributo <code>summary</code>.</p>
#Summary y Caption diferentes. 
check.243.error = La tabla de resumen duplica la tabla de pie de p\u00E1gina.
check.243.rationale = La tabla de resumen duplica la tabla de pie de p\u00E1gina.
#Uso del atributo scope (validando valores) 
check.415.error = Uso de valores incorrectos en el atributo <code>scope</code> de las tablas de datos.
check.415.rationale = <p>El valor empleado en al atributo <code>scope</code> usado para asociar las celdas de datos con las celdas de encabezado en las tablas de datos debe ser un valor correcto (<code>col, row, colgroup, rowgroup</code>).</p>
#Uso de encabezados como caption de una tabla 
check.464.error = Se han encontrado encabezados que se usan para indicar el t\u00EDtulo de tablas
check.464.rationale = <p>Use el elemento <code>CAPTION</code> para indicar el t\u00EDtulo de tablas de datos en vez de encabezados adyacentes</p>


#1.1.5 Agrupación estructural

#Utilizar br para simular párrafos 
check.16.error = Encontrado elemento <code>P</code> con m\u00E1s de 150 caracteres y 2 \u00F3 m\u00E1s elementos <code>BR</code> utilizados para simular p\u00E1rrafos de forma incorrecta.
check.16.rationale = <p>Los p\u00E1rrafos de texto en el contenido de la p\u00E1gina se deben marcar individualmente mediante un elemento <code>P</code> por p\u00E1rrafo, en lugar de incluir varios p\u00E1rrafos dentro de un <code>P</code> y realizar la separaci\u00F3n visual mediante el elemento <code>BR</code>.</p>
#Utilizar div para simular un párrafo 
check.33.error = Elemento <code>DIV</code> que contiene un texto de m\u00E1s de 150 caracteres sin emplear ninguna etiqueta de marcado de texto (<code>P</code>, <code>Q</code>, <code>BLOCKQUOTE</code>, etc.).
check.33.rationale = <p>Los p\u00E1rrafos de texto en el contenido de la p\u00E1gina se deben marcar mediante los elementos HTML destinados a ese fin, en lugar de utilizar elementos sin valor sem\u00E1ntico.</p>
#No se utilizan más de 10 brs en la página 
check.436.error = Abuso de saltos de l\u00EDnea <code>BR</code> en lugar de emplear elementos estructurales m\u00E1s adecuados.
check.436.rationale = <p>Los saltos de l\u00EDnea con el elemento <code>BR</code> se han de emplear de forma excepcional y s\u00F3lo si est\u00E1 justificado su uso. Si se puede emplear otro elemento estructural m\u00E1s adecuado para organizar el contenido se ha de emplear dicho elemento en su lugar. Por ejemplo, para un listado se deber\u00E1 emplear el marcado de listas (<code>UL, OL, LI</code>, etc.) y los p\u00E1rrafos se deben marcar con el elemento apropiado (<code>P</code>) en lugar de simular dichas estructuras mediante saltos de l\u00EDneas. Un abuso de los saltos de l\u00EDnea indica una deficiencia en el marcado estrutural de la p\u00E1gina.</p>


#1.1.6 Separación contenido y presentación

#Utilizar en tablas de maquetación elementos de tablas de datos (th, caption, summary,...) 
check.45.error = Se emplea marcado estructural en tablas de maquetaci\u00F3n.
check.45.rationale = <p>Cuando se utilicen tablas para maquetar, \u00E9stas no deben incluir elementos estructurales (<code>TH</code>, <code>THEAD</code>, <code>TBODY</code>, <code>TFOOT</code> y <code>CAPTION</code>) para crear formatos visuales. Por ejemplo, si una celda no es realmente un encabezamiento, no se debe utilizar el elemento <code>TH</code> para que tenga una apariencia determinada, sino dar formato al texto mediante hojas de estilo.</p><p>Se deben eliminar los elementos estructurales que se incluyen en las tablas de maquetaci\u00F3n listadas a continuaci\u00F3n</p>
#Uso de elementos HTML de presentación desaconsejados (basefont, font, center, s, strike, u) 
check.345.error = Uso de elementos HTML de presentaci\u00F3n desaconsejados.
check.345.rationale = <p>Se debe evitar elementos o atributos desaconsejados por el W3C en el c\u00F3digo de las p\u00E1ginas Web, ya que pueden quedar obsoletos en las pr\u00F3ximas versiones del lenguaje y no contar con soporte en los navegadores.</p><p>Se debe evitar el empleo de atributos HTML de presentaci\u00F3n en la p\u00E1gina, utilizando en todo momento las hojas de estilo para controlar la presentaci\u00F3n.</p>
#Contenido desde CSS mediante :before o :after y la propiedad “content” con texto igual o superior a X caracteres alfanuméricos (Heurístico X=2).
check.447.error = Generaci\u00F3n de informaci\u00F3n desde las hojas de estilo.
check.447.rationale = <p>No deben emplearse las hojas de estilo para incluir contenido o informaci\u00F3n ya que de esta forma no estar\u00E1 disponible para los lectores de pantalla u otras aplicaciones de usuario no gr\u00E1ficas. Toda la informaci\u00F3n debe estar disponible en el contenido de la p\u00E1gina, en el c\u00F3digo HTML.</p>


#1.1.7 Identificación del idioma principal

#Documento con atributos lang/xml:lang adecuados al tipo de documento (html/xhtml) 
check.48.error = Idioma del documento no identificado.
check.48.rationale = <p>El atributo <code>lang</code> permite a la tecnologia asistencial orientar y adaptar la pronunciaci\u00F3n y la sintaxis espec\u00EDficas del lenguaje de la p\u00E1gina. Este atributo puede jugar un papel importante en el emergente entorno web global de traducci\u00F3n simultanea.</p>

check.49.error = El documento tiene un c\u00F3digo de idioma incorrecto.
check.49.rationale = Debes usar un codigo de 2 o 3 letras v\u00E1lido para identificar el idioma principal del contenido.
#Comprobar que el idioma de la página coincide con el declarado 
check.442.error = El idioma de la p\u00E1gina no coincide con el especificado.
check.442.rationale = <p>El idioma de la p\u00E1gina no corresponde con el idioma definido. Aseg\u00FArese que si usa t\u00E9rminos en otros idiomas estos est\u00E1n correctamente identificados con su idioma correspondiente.</p>


#1.2.1 Identificación de cambios de idioma

#Elementos (*todos*) con código de idioma no válido 
check.161.error = El c\u00F3digo de idioma especificado no es v\u00E1lido seg\u00FAn la lista oficial de IANA (es, ca, eu, gl, ca-valencia, en, fr).
check.161.rationale = <p>A la hora de identificar un idioma en la p\u00E1gina se debe hacer mediante los c\u00F3digos de idioma est\u00E1ndar, y utilizando una sintaxis correcta.</p><p>Los c\u00F3digos de idioma siguientes no son est\u00E1ndar o no utilizan la sintaxis adecuada.</p>
#Cambios de idioma más comunes (enlaces de cambio de idioma) 
check.93.error = No se marcan los cambios de idioma en los enlaces habituales de cambio de idioma del portal: "Espa\u00F1ol", "Fran\u00E7ais", "English", "Bienvenido", "Bienvenue", "Wellcome", etc. O los c\u00F3digos de idiona utilizados no son v\u00E1lidos seg\u00FAn la lista de c\u00F3digos de idioma de IANA (es, ca, eu, gl, ca-valencia, en, fr)..
check.93.rationale = <p>Identificar los cambios de idioma en el contenido de las p\u00E1ginas facilita la comprensi\u00F3n de los documentos a los usuarios que utilizan lectores de pantalla o programas de s\u00EDntesis de voz, ya que \u00E9stos detectar\u00E1n el cambio de idioma y verbalizar\u00E1n correctamente el contenido.</p><p>Excepcionalmente no es necesario marcar el cambio de idioma en nombres propios y palabras empleadas com\u00FAnmente en su idioma original.</p><p>Se debe marcar de forma adecuada el correspondiente cambio de idioma en los enlaces que se muestran a continuaci\u00F3n.</p><p>Se puede comprobar la lista completa de c\u00F3digos de idioma de IANA en la siguiente direcci\u00F3n: <a href = "http://www.iana.org/assignments/language-subtag-registry">http://www.iana.org/assignments/language-subtag-registry</a></p>
#Términos en otros idiomas 
check.460.error = Cambios de idioma sin especificar.
check.460.rationale = <p>Cuando en el contenido de la p\u00E1gina se produzca alg\u00FAn cambio de idioma se debe identificar dicho cambio de idioma con el atributo <code>lang</code> empleando un c\u00F3digo de idioma v\u00E1lido seg\u00FAn la lista de lenguajes que proporciona la Agencia de Asignaci\u00F3n de N\u00FAmeros de Internet (IANA). Los lectores de pantalla usar\u00E1n esta informaci\u00F3n para utilizar la pronunciaci\u00F3n y entonaci\u00F3n adecuada al leer el contenido.</p>


#1.2.2 Contraste mínimo

#Se verifica que las combinaciones de color de primer plano y de color de fondo en una misma regla de las hojas de estilo tiene el contraste suficiente. 
check.448.error = Contraste insuficiente entre el color de primer plano y el color de fondo.
check.448.rationale = <p>Las combinaciones de color entre el color de primer plano, del texto, y el color de fondo deben respetar el ratio de contraste m\u00EDnimo exigido para que todas las personas puedan leer el contenido, incluyendo aquellas con dificultades visuales.</p>



#1.2.3 Sección de accesibilidad

#
check.126.error = No se ha encontrado un enlace a la secci\u00F3n de Accesibilidad en la p\u00E1gina (enlaces con texto "Accesibilidad", "Accessibility", etc.).
check.126.rationale = <p>Seg\u00FAn el Real Decreto 1494/2007, los sitios Web de la Administraci\u00F3n deben disponer de una p\u00E1gina que indique las medidas de Accesibilidad adoptadas para asegurar el acceso a su informaci\u00F3n para todos los usuarios, la fecha de la \u00FAltima revisi\u00F3n de Accesibilidad, y un mecanismo de contacto.</p>
#
check.148.error = La Declaraci\u00F3n de Accesibilidad del portal carece de forma de contacto con los administradores del sitio.
check.148.rationale = <p>Seg\u00FAn el Real Decreto 1494/2007, los sitios Web de la Administraci\u00F3n deben disponer de una p\u00E1gina que indique las medidas de Accesibilidad adoptadas para asegurar el acceso a su informaci\u00F3n para todos los usuarios, la fecha de la \u00FAltima revisi\u00F3n de Accesibilidad, y un mecanismo de contacto.</p>
#
check.149.error = La Declaraci\u00F3n de Accesibilidad del portal no especifica la fecha de la \u00FAltima revisi\u00F3n de la accesibilidad del sitio.
check.149.rationale = <p>Seg\u00FAn el Real Decreto 1494/2007, los sitios Web de la Administraci\u00F3n deben disponer de una p\u00E1gina que indique las medidas de Accesibilidad adoptadas para asegurar el acceso a su informaci\u00F3n para todos los usuarios, la fecha de la \u00FAltima revisi\u00F3n de Accesibilidad, y un mecanismo de contacto.</p>
#Se comprueba si en la página de accesibilidad se proporciona información sobre el nivel de conformidad.
check.463.error = La Declaraci\u00F3n de Accesibilidad del portal carece del nivel de accesibilidad alcanzado.
check.463.rationale = <p>La Declaraci\u00F3n de Accesibilidad del portal debe indicar el nivel de accesibilidad alcanzado as\u00ED como cualquier caracter\u00EDstica particular del portal que afecte a su accesibilidad</p>


#Prioridad 2: Accesibilidad de la interacción 

#2.1.1 Navegación con Javascript accesible

#Si se usan eventos dependientes de dispositivo, éstos están replicados 
check.160.error = Se han encontrado eventos dependientes de dispositivo no replicados.
check.160.rationale = <p>Se deben utilizar eventos l\u00F3gicos (a nivel de aplicaci\u00F3n), en lugar de eventos dependientes de dispositivo. Si se tienen que emplear atributos espec\u00EDficos de un dispositivo, se debe proporcionar mecanismos redundantes de interacci\u00F3n, es decir, especificar manejadores complementarios para un mismo evento.</p>
#Elementos con “onclick” u “onkeypress” son nativos de interacción (enlaces, botones) o bien tienen asignado un atributo “tabindex” y un “role” de WAI-ARIA adecuado 
check.432.error = Elementos de interacci\u00F3n no accesibles programados mediante scripts.
check.432.rationale = <p>Cuando se empleen scripts para a\u00F1adir funcionalidades e interacci\u00F3n se debe hacer de forma que se preserve la accesibilidad del elemento. As\u00ED, en principio, los elementos de interacci\u00F3n a usar han de ser enlaces o botones est\u00E1ndar. En caso de a\u00F1adir funcionalidad mediante scripts a elementos est\u00E1ticos como im\u00E1genes (<code>IMG</code>), celdas o filas de tablas (<code>TR, TH, TD</code>), elementos <code>SPAN</code>, <code>DIV</code>, etc., para crear componentes de interacci\u00F3n personalizados entonces se ha de hacer de forma que sigan siendo accesibles con teclado y compatibles con los productos de apoyo aplicando las recomendaciones de WAI-ARIA.</p>


#2.1.2 Control del usuario

#Se verifica que no se use la etiqueta "blink" o “marquee” 
check.130.error = Se utilizan elementos HTML que provocan movimientos y parpadeos que no pueden ser controlados por el usuario (<code>blink</code> o <code>marquee</code>).
check.130.rationale = <p>Los elementos <code>BLINK</code> y <code>MARQUEE</code> producen parpadeos y movimientos, respectivamente, que no pueden ser parados por el usuario, lo cual puede dificultar la lectura de la p\u00E1gina a determinados usuarios, especialmente aquellos con d\u00E9ficit de atenci\u00F3n. Adem\u00E1s, estos elementos no pertenecen a la especificaci\u00F3n de HTML.</p>
#No se debe redigir automáticamente con el elemento "meta" y el atributo "http-equiv" (con tiempo > 0) 
check.71.error = Se produce una redirecci\u00F3n autom\u00E1tica de la p\u00E1gina.
check.71.rationale = <p>En caso de que sea necesario redirigir una p\u00E1gina hacia otra, se debe configurar el servidor para que realice dicha acci\u00F3n, de forma que \u00E9sta sea transparente al usuario. Cuando esto no sea posible, se proporcionar\u00E1 una p\u00E1gina est\u00E1tica que contenga un enlace hac\u00EDa la nueva localizaci\u00F3n.</p><p>Se ha detectado el uso del metadato <code>refresh</code> para redireccionar la p\u00E1gina. Se debe eliminar dicho metadato y realizar de forma adecuada la redirecci\u00F3n de la p\u00E1gina</p>
#No se refresca la página con el elemento "meta" y el atributo "http-equiv" (independientemente del tiempo definido) 
check.72.error = Se produce una actualizaci\u00F3n autom\u00E1tica de la p\u00E1gina.
check.72.rationale = <p>Ya que el autor de una p\u00E1gina web no puede predecir cuanto tardar\u00E1 el usuario en leer su contenido, no debe crear p\u00E1ginas que se actualicen autom\u00E1ticamente y puedan desorientar al usuario. En lugar de configurar la p\u00E1gina para que se actualice de forma autom\u00E1tica, se debe proporcionar un enlace que permita al usuario realizar dicha acci\u00F3n cuando lo considere oportuno.</p><p>Se ha detectado el uso del metadato <code>refresh</code> para actualizar la p\u00E1gina. Se debe eliminar dicho metadato y permitir que sea el usuario el que decida cuando actualizar la p\u00E1gina.</p>
#No se emplea la propiedad de CSS 'text-decoration: blink' 
check.449.error = Se producen parpadeos en el texto haciendo uso de la propiedad <code>text-decoration: blink</code>.
check.449.rationale = <p>Debe evitarse la presencia de contenido con parpadeo ya que dificulta su lectura y comprensi\u00F3n a personas con problemas visuales o discapacidades cognitivas. Por otra parte, si el parpadeo implica cambios bruscos de luminosidad (destellos) pueden suponer un riesgo para las personas con epilepsia fotosensitiva.</p>


#2.1.3 Formularios

#Nota: Se considera etiqueta asociada a <label> (con texto) asociado explícitamente; “aria-labelledby” con un “id” correspondiente a un elemento con contenido textual; “aria-label” o “títle” con contenido. 
#Elementos input tienen una etiqueta explícitamente asociada 
check.57.error = Elemento <code>input</code> no tiene una etiqueta asociada expl\u00EDcitamente de forma correcta.
check.57.rationale = <p>La asociaci\u00F3n expl\u00EDcita elimina la dependencia en la colocaci\u00F3n de la etiqueta y su control, ya que los agentes de usuario los asociar\u00E1n autom\u00E1ticamente.</p><p>Para realizar dicha asociaci\u00F3n se debe utilizar el elemento <code>LABEL</code> con el atributo <code>for</code>, de forma que el valor del atributo <code>id</code> de cada control coincida con el valor del atributo <code>for</code> de su respectiva etiqueta. Pudiendo emplearse una \u00FAnica vez el mismo valor del atributo <code>id</code>.</p><p>Los elementos <code>input</code> listados a continuaci\u00F3n no poseen una \u00FAnica etiqueta asociada expl\u00EDcitamente.</p>
#Elementos label no asociados controla que exista for con un id válido (a un control) 
check.67.error = No se realiza la asociaci\u00F3n expl\u00EDcita adecuadamente entre controles y etiquetas.
check.67.rationale = <p>La asociaci\u00F3n expl\u00EDcita elimina la dependencia en la colocaci\u00F3n de la etiqueta y su control, ya que los agentes de usuario los asociar\u00E1n autom\u00E1ticamente.</p><p>Para realizar dicha asociaci\u00F3n se debe utilizar el elemento <code>LABEL</code> con el atributo <code>for</code>, de forma que el valor del atributo <code>id</code> de cada control coincida con el valor del atributo <code>for</code> de su respectiva etiqueta. Pudiendo emplearse una \u00FAnica vez el mismo valor del atributo <code>id</code>.</p><p>Las etiquetas listadas a continuaci\u00F3n no se asocian adecuadamente con un \u00FAnico control del formulario.</p>
#Elementos select tienen una etiqueta explícitamente asociada 
check.91.error = El elemento <code>SELECT</code> no tiene una etiqueta asociada expl\u00EDcitamente de forma correcta.
check.91.rationale = <p>La asociaci\u00F3n expl\u00EDcita elimina la dependencia en la colocaci\u00F3n de la etiqueta y su control, ya que los agentes de usuario los asociar\u00E1n autom\u00E1ticamente.</p><p>Para realizar dicha asociaci\u00F3n se debe utilizar el elemento <code>LABEL</code> con el atributo <code>for</code>, de forma que el valor del atributo <code>id</code> de cada control coincida con el valor del atributo <code>for</code> de su respectiva etiqueta. Pudiendo emplearse una \u00FAnica vez el mismo valor del atributo <code>id</code>.</p><p>Los elementos <code>select</code> listados a continuaci\u00F3n no poseen etiqueta asociada expl\u00EDcitamente.</p>
#Elementos textarea tienen una etiqueta explícitamente asociada 
check.95.error = Elemento <code>textarea</code> no tiene una etiqueta asociada expl\u00EDcitamente de forma correcta.
check.95.rationale = <p>La asociaci\u00F3n expl\u00EDcita elimina la dependencia en la colocaci\u00F3n de la etiqueta y su control, ya que los agentes de usuario los asociar\u00E1n autom\u00E1ticamente.</p><p>Para realizar dicha asociaci\u00F3n se debe utilizar el elemento <code>LABEL</code> con el atributo <code>for</code>, de forma que el valor del atributo <code>id</code> de cada control coincida con el valor del atributo <code>for</code> de su respectiva etiqueta. Pudiendo emplearse una \u00FAnica vez el mismo valor del atributo <code>id</code>.</p><p>Los elementos <code>textarea</code> listados a continuaci\u00F3n no poseen etiqueta asociada expl\u00EDcitamente.</p>
#Se verifica que todos los elementos “label” que están asociados explícitamente y son la única etiqueta asociada a un control (título, aria-label, etc.) no están ocultos con CSS.
check.461.error = Etiquetas de formulario ocultas visualmente.
check.461.rationale = <p>Las etiquetas <code>LABEL</code> de los campos de formulario no pueden estar ocultas visualmente si no existe otro mecanismo para indicar la funci\u00F3n del campo como, por ejemplo, el t\u00EDtulo del mismo (<code>title</code>). Todos los usuarios deben poder acceder a esta informaci\u00F3n, incluyendo los los usuarios de navegadores gr\u00E1ficos.</p>
#Tres o más de botones de radio y/o casillas de verificación agrupadas (mismo name) se agrupan bajo un fieldset.
check.443.error = Grupos de botones de radio o casillas de verificaci\u00F3n sin agrupar mediante <code>FIELDSET</code>.
check.443.rationale = <p>Cuando en un formulario existen diferentes grupos de campos de formulario relacionados entre s\u00ED se deben marcar dichos grupos con el elemento <code>FIELDSET</code> y se debe identificar cada grupo con una etiqueta proporcionada en el elemento <code>LEGEND</code> correspondiente. Esto es especialmente importante en los grupos de botones de radio y casillas de verificaci\u00F3n. Si hay grupos de tres o m\u00E1s botones de radio o casillas de verificaci\u00F3n (con el mismo <code>name</code>) entonces cada grupo se debe identificar con el elemento <code>FIELDSET</code>.</p>
#Se verifica que no existan dos o más elementos de encabezado dentro de un elemento <form> (en lugar de usar “fieldset”) 
check.429.error = Uso de encabezados dentro de formularios para agrupar los grupos de campos de formulario.
check.429.rationale = <p>Para agrupar los campos de formulario relacionados entre s\u00ED se ha de emplear el elemento <code>FIELDSET</code> y se debe identificar el grupo con una etiqueta indicada en el elemento <code>LEGEND</code> correspondiente, en lugar de emplear encabezados dentro del formulario para simular dichas divisiones o agrupaciones de campos.</p>
#Modificación especial de la comprobación 429 para Sharepoint 
check.466.error = Uso de encabezados dentro de formularios para agrupar los grupos de campos de formulario.
check.466.rationale = <p>Para agrupar los campos de formulario relacionados entre s\u00ED se ha de emplear el elemento <code>FIELDSET</code> y se debe identificar el grupo con una etiqueta indicada en el elemento <code>LEGEND</code> correspondiente, en lugar de emplear encabezados dentro del formulario para simular dichas divisiones o agrupaciones de campos.</p>
#En formularios con X o más campos (text, file, password, select, textarea) debe existir al menos un fieldset y un legend (Heuristico X=10) 
check.430.error = Ausencia de agrupaciones de campos de formulario.
check.430.rationale = <p>Cuando en un formulario existen diferentes grupos de campos de formulario relacionados entre s\u00ED se deben marcar dichos grupos con el elemento <code>FIELDSET</code> y se debe identificar cada grupo con una etiqueta proporcionada en el elemento <code>LEGEND</code> correspondiente. Esto es especialmente importante en los formularios con un n\u00FAmero significativo de campos para establecer las diferentes agrupaciones que faciliten su comprensi\u00F3n a los usuarios.</p>
#En formularios con X o más campos (text, file, password, select, textarea) debe existir al menos un fieldset y un legend (Heuristico X=8) 0-PASA 
check.465.error = Ausencia de agrupaciones de campos de formulario.
check.465.rationale = <p>Cuando en un formulario existen diferentes grupos de campos de formulario relacionados entre s\u00ED se deben marcar dichos grupos con el elemento <code>FIELDSET</code> y se debe identificar cada grupo con una etiqueta proporcionada en el elemento <code>LEGEND</code> correspondiente. Esto es especialmente importante en los formularios con un n\u00FAmero significativo de campos para establecer las diferentes agrupaciones que faciliten su comprensi\u00F3n a los usuarios.</p>
#Se verifica que  los “fieldsets” tengan un único elemento “legend” con contenido (primer elemento semántico hijo).
check.444.error = Elementos <code>FIELDSET</code> que carecen de etiqueta para identificar su contenido.
check.444.rationale = <p>El elemento <code>FIELDSET</code> se emplea para identificar los grupos de controles de formulario relacionados entre s\u00ED. Sin embargo, tambi\u00E9n es necesario proporcionar una etiqueta que describa la naturaleza o funci\u00F3n de cada grupo mediante el elemento <code>LEGEND</code>. Por tanto, todo elemento <code>FIELDSET</code> debe tener su correspondiente elemento <code>LEGEND</code>.</p>
#Elementos select con más de X opciones sin agrupar bajo elementos “optgroup”. (X=20) 
check.406.error = Se incluyen <code>SELECT</code> con muchas opciones no agrupadas. Comprobar si es necesaria la agrupaci\u00F3n de \u00E9stas mediante elemento <code>OPTGROUP</code>.
check.406.rationale =
#Elementos select con opciones que comiencen por sucesiones de 3 o más caracteres repetidos no alfanuméricos (P. ej: “___”, “***”, “......”, etc.).
check.417.error = Simulaci\u00F3n de grupos de opciones en elementos <code>SELECT</code>.
check.417.rationale = <p>Los grupos de opciones <code>OPTION</code> en los <code>SELECT</code> se deben marcar con el elemento <code>OPTGROUP</code> y etiquetarse con el atributo <code>LABEL</code> en lugar de emplear elementos <code>OPTION</code> falsos para simular estas divisiones.</p>
#Elementos optgroup tienen un atributo “label” con contenido 
check.407.error=
check.407.rationale=
#Se identifican los campos obligatorios en los formularios con más de N campos de introducción de texto (se busca la presencia de los términos “obligatorio”, “opcional” o sinónimos equivalentes en el texto, alternativas o títulos presentes dentro del formulario <form>). (N = 4) 
check.446.error = No se indica qu\u00E9 campos de formulario son obligatorios.
check.446.rationale = <p>En los formularios en los que hay varios campos se debe proporcionar a los usuarios informaci\u00F3n para que puedan diferenciar entre los campos obligatorios y los campos opcionales reduciendo as\u00ED las posibilidades de que se produzcan errores de validaci\u00F3n a la hora de cumplimentar el formulario.</p>


#2.1.4 Títulos de página y marcos descriptivos

#Existencia de title 
check.50.error = No se emplea el metadato <code>TITLE</code>
check.50.rationale = <p>Debido a que los usuarios a menudo consultan las p\u00E1ginas fuera de contexto, los autores deber\u00EDan proporcionar t\u00EDtulos que identifiquen los contenidos de la p\u00E1gina.</p><p>Indicar en el TITLE de una p\u00E1gina el nombre del portal y una peque\u00F1a frase que identifique un\u00EDvocamente la p\u00E1gina dentro del mismo constituye una buena forma de facilitar al usuario la localizaci\u00F3n e identificaci\u00F3n de las p\u00E1ginas.</p>
#Title NO vacío 
check.51.error = El elemento <code>title</code> est\u00E1 vacio.
check.51.rationale = <p>Debido a que los usuarios a menudo consultan las p\u00E1ginas fuera de contexto, los autores deber\u00EDan proporcionar t\u00EDtulos que identifiquen los contenidos de la p\u00E1gina.</p><p>Indicar en el TITLE de una p\u00E1gina el nombre del portal y una peque\u00F1a frase que identifique un\u00EDvocamente la p\u00E1gina dentro del mismo constituye una buena forma de facilitar al usuario la localizaci\u00F3n e identificaci\u00F3n de las p\u00E1ginas.</p>
#Title sospechoso (no title, sin título...) 
check.53.error = El t\u00EDtulo del documento no es descriptivo, al utilizar un texto predefinido como "T\u00EDtulo", "Untitled", "Untitled Document", etc.
check.53.rationale = <p>Debido a que los usuarios a menudo consultan las p\u00E1ginas fuera de contexto, los autores deber\u00EDan proporcionar t\u00EDtulos que identifiquen los contenidos de la p\u00E1gina.</p><p>Indicar en el TITLE de una p\u00E1gina el nombre del portal y una peque\u00F1a frase que identifique un\u00EDvocamente la p\u00E1gina dentro del mismo constituye una buena forma de facilitar al usuario la localizaci\u00F3n e identificaci\u00F3n de las p\u00E1ginas.</p>
#Comprobación para fijar como máximo resultado GREEN_ZERO si se usan frames 
check.32.error = El <code>title</code> del <code>frame</code> puede no describir el prop\u00F3sito del <code>frame</code>.
check.32.rationale=
#Comprobación para fijar como máximo resultado GREEN_ZERO si se usan iframes 
check.437.error =
check.437.rationale =
#Frames tienen atributo title no vacío ni sospechoso 
check.31.error = No se titula correctamente el marco <code>frame</code>.
check.31.rationale = <p>Se debe evitar, en la medida de lo posible, el uso de marcos en las p\u00E1ginas. De no ser posible evitarlo, se debe proporcionar un t\u00EDtulo a cada marco que describa su prop\u00F3sito.</p><p>Esta descripci\u00F3n debe ser precisa e indicarse en su atributo <code>title</code>.</p>
#Iframes tienen atributo title no vacío ni sospechoso 
check.295.error = No se titula correctamente el marco <code>iframe</code>.
check.295.rationale = <p>Se debe evitar, en la medida de lo posible, el uso de marcos en las p\u00E1ginas. De no ser posible evitarlo, se debe proporcionar un t\u00EDtulo a cada marco que describa su prop\u00F3sito.</p><p>Esta descripci\u00F3n debe ser precisa e indicarse en su atributo <code>title</code>.</p>
#Comprobar titulos distintos entre la muestra 
check.462.error = Las p\u00E1ginas analizadas en el muestreo presentan todas el mismo t\u00EDtulo.
check.462.rationale = <p>Deben proporcionarse t\u00EDtulos (etiquetas <code>TITLE</code>) adecuados a las p\u00E1ginas web para que sirvan de orientaci\u00F3n dentro de la navegaci\u00F3n del portal.</p>


#2.1.5 Enlaces descriptivos

#Enlaces con solo una imagen que no tenga atributo alt 
check.69.error = Hay enlaces cuyo contenido solo consiste en una imagen y la imagen tiene <code>alt</code> vac\u00EDo.
check.69.rationale = <p>El texto de los enlaces debe ser suficientemente claro para identificar su destino cuando es le\u00EDdo fuera de contexto. En caso de necesitar alg\u00FAn tipo de informaci\u00F3n adicional deber\u00E1 ser a\u00F1adida por medio del atributo title, el cu\u00E1l contendr\u00E1 todo el texto del enlace adem\u00E1s de dicha informaci\u00F3n adicional.</p><p>Se debe proporcionar a la imagen un texto alternativo que describa el destino del enlace.</p>
#Enlaces con textos demasiado largos, excepto si el texto del enlace es el nombre de una ley 
check.181.error=
check.181.rationale = <p>El texto de los enlaces debe ser suficientemente claro para identificar su destino cuando es le\u00EDdo fuera de contexto, y adem\u00E1s debe ser conciso.</p><p>Los siguientes enlaces tienen un texto demasiado largo, lo que dificultar\u00E1 su legibilidad y comprensi\u00F3n para algunos usuarios.</p>
#Enlaces no descriptivos (pincha aqui, haz click...) 
check.79.error = Existen enlaces cuyo texto no es descriptivo (textos similares como "aqu\u00ED", "pinche aqu\u00ED", "haga clic aqu\u00ED", etc.).
check.79.rationale = <p>El texto de los enlaces debe ser suficientemente claro para identificar su destino cuando es le\u00EDdo fuera de contexto. En caso de necesitar alg\u00FAn tipo de informaci\u00F3n adicional deber\u00E1 ser a\u00F1adida por medio del atributo title, el cu\u00E1l contendr\u00E1 todo el texto del enlace adem\u00E1s de dicha informaci\u00F3n adicional.</p><p>Por ejemplo, enlaces del estilo a "pinche aqu\u00ED", "m\u00E1s informaci\u00F3n"... no identifican su destino cuando se accede a ellos fuera de contexto. A este tipo de enlaces se le debe a\u00F1adir informaci\u00F3n que identifique sin lugar a dudas su destino.</p>
#Enlace con texto vacío (se comprueba que haya imagen con alt (pero no si es vacio) 
check.142.error = Se han encontrado enlaces sin texto.
check.142.rationale = Existen enlaces que no contienen un texto o bien contienen una imagen sin alternativa textual.
#Enlace de texto con imagen que repite el texto del enlace como alternativa 
check.428.error = Im\u00E1genes incluidas dentro de enlaces que repiten el texto del enlace en su alternativa.
check.428.rationale = <p>Las im\u00E1genes que forman parte de enlaces que adem\u00E1s est\u00E1n acompa\u00F1adas de un texto (el texto del enlace) no deben repetir en su atributo <code>alt</code> el texto del enlace para evitar repeticiones innecesarias de contenido que pueden entorpecer el uso de la p\u00E1gina a los usuarios de lectores de pantalla. Si la imagen no aporta informaci\u00F3n adicional entonces debe marcarse como una imagen decorativa con texto alternativo vac\u00EDo (<code>alt=""</code>) y sin t\u00EDtulo.</p>


#2.1.6 Cambios de contexto 

#No se produce ningún cambio de contexto en los eventos “onfocus” u “onblur” 
check.452.error = Cambio de contexto cuando un elemento recibe o pierde el foco.
check.452.rationale = <p>Los cambios de contexto como la apertura de una nueva ventana o pesta\u00F1a del navegador, los cambios del foco o acceder a una p\u00E1gina nueva, s\u00F3lo deben producirse bajo petici\u00F3n de los usuarios y tras una acci\u00F3n expl\u00EDcita como pulsar un enlace o bot\u00F3n, y no en otras circunstancias como cuando un elemento recibe o pierde el foco.</p>
#No se produce ningún cambio de contexto nada más cargarse la página (onload) 
check.453.error = Cambio de contexto nada m\u00E1s cargarse la p\u00E1gina.
check.453.rationale = <p>Los cambios de contexto como la apertura de una nueva ventana o pesta\u00F1a del navegador, los cambios del foco o acceder a una p\u00E1gina nueva, s\u00F3lo deben producirse bajo petici\u00F3n de los usuarios y tras una acci\u00F3n expl\u00EDcita como pulsar un enlace o bot\u00F3n, y no en otras circunstancias como nada m\u00E1s cargarse la p\u00E1gina.</p>
#No se produce ningún cambio de contexto en el evento “onchange” de los elementos “select” 
check.454.error = Cambio de contexto al seleccionar una opci\u00F3n de un <code>SELECT</code>.
check.454.rationale = <p>Los cambios de contexto como la apertura de una nueva ventana o pesta\u00F1a del navegador, los cambios del foco o acceder a una p\u00E1gina nueva, s\u00F3lo deben producirse bajo petici\u00F3n de los usuarios y tras una acci\u00F3n expl\u00EDcita como pulsar un enlace o bot\u00F3n, y no en otras circunstancias como al seleccionar una opci\u00F3n de un <code>SELECT</code>.</p>


#2.1.7 Compatibilidad 

#Documento tenga un DTD válido 
check.323.error = No se indica la Definici\u00F3n del Tipo de Documento (DTD), o \u00E9sta no es correcta.
check.323.rationale = <p>El validador no es capaz de determinar qu\u00E9 tipo de documento es la p\u00E1gina Web.</p><p>Se debe revisar el DTD declarado, el tipo de codificaci\u00F3n de caracteres y el tipo mime declarado de la p\u00E1gina.</p>
#Código HTML sea parseable (apertura y cierre de etiquetas y anidamiento correcto de elementos) 
check.440.error = Anidamiento incorrecto de etiquetas.
check.440.rationale = <p>El marcado debe ser correcto para evitar que se produzcan errores en el c\u00F3digo que puedan dificultar la interpretaci\u00F3n del mismo por parte de las aplicaciones de usuarios. Para que los navegadores identifiquen la estructura y jerarqu\u00EDa de los elementos que forman el c\u00F3digo de la p\u00E1gina es necesario que \u00E9stos se aniden de forma correcta, respetando el orden de apertura y cierre de las etiquetas.</p>
#Se verifica que no se repite el mismo atributo con diferente valor en el mismo elemento 
check.441.error = Atributos duplicados en la misma etiqueta.
check.441.rationale = <p>El marcado debe ser correcto para evitar que se produzcan errores en el c\u00F3digo que puedan dificultar la interpretaci\u00F3n del mismo por parte de las aplicaciones de usuarios. Para ello, no debe haber atributos repetidos para un mismo elemento ya que se crea un conflicto en la elecci\u00F3n del valor adecuado pudiendo dar lugar a inconsistencias de interpretaci\u00F3n entre diferentes navegadores.</p>
#Se verifica que los valores de los atributos están entrecomillados 
check.439.error = Ausencia de entrecomillado para los valores de atributos.
check.439.rationale = <p>El marcado debe ser correcto para evitar que se produzcan errores en el c\u00F3digo que puedan dificultar la interpretaci\u00F3n del mismo por parte de las aplicaciones de usuarios. Para que los navegadores identifiquen sin posibilidad de error cu\u00E1l es el valor de cada atributo \u00E9ste se ha de entrecomillar para deliminar de forma expl\u00EDcita sus l\u00EDmites.</p>
#Se verifica que el valor de los atributos que deben tener un valor único por página (“id”, “accesskey”) efectivamente tienen un valor único 
check.438.error = Uso de identificadores repetidos en la misma p\u00E1gina.
check.438.rationale = <p>Los identificadores (atributo <code>id</code>) se emplean para identificar de forma un\u00EDvoca los elementos en la p\u00E1gina. Son de utilidad para establecer relaciones entre los contenidos, como relacionar las etiquetas con los controles de formulario o las celdas de datos con las celdas de encabezado en las tablas de datos. Por tanto, los identificadores usados deben ser \u00FAnicos en cada p\u00E1gina para que se puedan establecer estas relaciones un\u00EDvocas. Si necesita repetir el mismo identificador para varios elementos considere el uso de clases en su lugar (atributo <code>class</code>).</p>
#Se verifica que el código CSS es parseable (bien formado, sin errores de sintaxis) 
check.450.error = Presencia de errores en el c\u00F3digo CSS que pueden dificultar su correcto procesamiento.
check.450.rationale = <p>El c\u00F3digo de las hojas de estilo debe estar libre de errores que puedan suponer una inconsistencia en su interpretaci\u00F3n por parte de diferentes navegadores o aplicaciones de usuario. Es decir, el c\u00F3digo debe poder ser procesado sin inconsistencias. Esto no implica que el c\u00F3digo deba ser gramaticalmente v\u00E1lido o que no se empleen propiedades avanzadas o experimentales como las de CSS3 o las equivalentes de los diferentes motores de los navegadores, sino que al menos el c\u00F3digo ha de ser sint\u00E1cticamente correcto.</p>

#2.2.1 Multiples Ways 

#Se proporciona un mapa del sitio o una función de búsqueda dentro del sitio web. 
check.419.error = No se ha encontrado un enlace al mapa web ni opci\u00F3n de buscador.
check.419.rationale = <p>Deben proporcionarse m\u00E9todos complementarios de navegaci\u00F3n como un mapa web o la inclusi\u00F3n de un buscador que permitan localizar una p\u00E1gina web.</p>

#2.2.2 Foco Visible 

#Se verifica que en las hojas de estilo no se emplee la propiedad “outline” con valor “0” o “none” en elementos de interacción.
check.451.error = Indicador del foco del teclado no visible.
check.451.rationale = <p>El indicador del foco del teclado ha de ser visible de forma que los usuarios que empleen un navegador gr\u00E1fico junto con un teclado o un dispositivo similar como medio de interacci\u00F3n (personas con discapacidades motrices) puedan ver la posici\u00F3n del foco mientras tabulan por los elementos de interacci\u00F3n de la p\u00E1gina. Para ello ha de respetarse el indicador del foco usado por defecto en los navegadores (sin eliminarlo con propiedades como <code>outline: none</code>) y, en caso de modificarlo, ser\u00E1 s\u00F3lo para mejorar su visibilidad no para eliminarlo.</p>
#Se verifica que no se estén empleando más de 3 atributos “tabindex” en la página (0 - PASA) 
check.434.error = Abuso del atributo <code>tabindex</code> para modificar el orden de tabulaci\u00F3n por defecto.
check.434.rationale = <p>El orden de tabulaci\u00F3n debe ser correcto. Para ello, el orden del contenido en el c\u00F3digo debe seguir un orden l\u00F3gico correcto de forma que el orden de tabulaci\u00F3n por defecto ya sea el adecuado. Excepcionalmente, y de forma puntual, se pueden emplear el atributo <code>tabindex</code> para modificar dicho orden por defecto como, por ejemplo, para hacer que el campo de b\u00FAsqueda sea el primer elemento tabulable en una p\u00E1gina. Sin embargo, no se deber\u00EDa abusar del atributo <code>tabindex</code> (con valor positivo, >0) para modificar el orden de tabulaci\u00F3n por defecto.</p>
#Se verifica que no se estén empleando más de 10 atributos “tabindex” en la página (0- FALLA)
check.435.error = Uso excesivo y generalizado del atributo <code>tabindex</code> para modificar el orden de tabulaci\u00F3n por defecto.
check.435.rationale = <p>El orden de tabulaci\u00F3n debe ser correcto. Para ello, el orden del contenido en el c\u00F3digo debe seguir un orden l\u00F3gico correcto de forma que el orden de tabulaci\u00F3n por defecto ya sea el adecuado. Excepcionalmente, y de forma puntual, se pueden emplear el atributo <code>tabindex</code> para modificar dicho orden por defecto como, por ejemplo, para hacer que el campo de b\u00FAsqueda sea el primer elemento tabulable en una p\u00E1gina. Sin embargo, no se debe usar excesivamente y de forma generalizada el atributo <code>tabindex</code> (con valor positivo, >0) para modificar el orden de tabulaci\u00F3n por defecto.</p>


#2.2.3 Navegación Consistente 

#Si solo hay un enlace interno roto se controla mediante el check 455 con valor GREEN-ZERO
#si hay más de un enlace interno entonces falla también por la comprobación 456 y el valor es RED-ZERO 
#Comprobamos que si hay enlaces rotos 
check.455.error = Presencia de alg\u00FAn enlace interno roto en la p\u00E1gina.
check.455.rationale = <p>Debe evitarse la presencia de enlaces rotos en la p\u00E1gina ya que suponen una ruptura en la navegaci\u00F3n que genera dificultades y posiblemente desorientaci\u00F3n a los usuarios de lectores de pantalla u otros productos de apoyo as\u00ED como a las personas con problemas cognitivos.</p>
#Comprobamos que haya MÁS de 1 enlace roto 
check.456.error = Presencia de varios enlaces internos rotos en la p\u00E1gina.
check.456.rationale = <p>Debe evitarse la presencia de enlaces rotos en la p\u00E1gina ya que suponen una ruptura en la navegaci\u00F3n que genera dificultades y posiblemente desorientaci\u00F3n a los usuarios de lectores de pantalla u otros productos de apoyo as\u00ED como a las personas con problemas cognitivos.</p>
#Idem para enlaces externos  
#Comprobamos que si hay enlaces externos rotos 
check.457.error = Presencia de alg\u00FAn enlace externo roto en la p\u00E1gina.
check.457.rationale = <p>Debe evitarse la presencia de enlaces rotos en la p\u00E1gina ya que suponen una ruptura en la navegaci\u00F3n que genera dificultades y posiblemente desorientaci\u00F3n a los usuarios de lectores de pantalla u otros productos de apoyo as\u00ED como a las personas con problemas cognitivos.</p>
#Comprobamos que haya MÁS de 2 enlaces rotos 
check.458.error = Presencia de varios enlaces externos rotos en la p\u00E1gina.
check.458.rationale = <p>Debe evitarse la presencia de enlaces rotos en la p\u00E1gina ya que suponen una ruptura en la navegaci\u00F3n que genera dificultades y posiblemente desorientaci\u00F3n a los usuarios de lectores de pantalla u otros productos de apoyo as\u00ED como a las personas con problemas cognitivos.</p>
#Enlaces adyacentes al mismo recurso deben estar combinados 
check.180.error = Existen enlaces adyacentes que apuntan al mismo destino.
check.180.rationale = <p>La duplicaci\u00F3n de enlaces seguidos en la p\u00E1gina a\u00F1ade ruido y contenido innecesario que puede entorpecer la legibiliad de la misma a algunos usuarios.</p><p>No obstante, el objetivo principal de esta verificaci\u00F3n es detectar la pr\u00E1ctica desaconsejada (y a\u00FAn habitual) de utilizar un icono junto a un texto de enlace, marcado el icono y el texto como dos enlaces independientes, en lugar de utilizar un \u00FAnico enlace que englobe ambos elementos.</p>
