{
    "BTN_COLLAPSE_PAGES": "Ocultar páginas web para introducir resultados individuales",
    "BTN_COMPLETE_SELECTED": "Marcar el conjunto seleccionado como completado",
    "BTN_EXPAND_PAGES": "Mostrar páginas web para introducir resultados individuales",
    "BTN_OPEN_SELECTED": "Abrir las páginas seleccionadas",
    "BTN_SHOW_TEXT": "Mostrar el texto del criterio",
    "BTN_UNCOMPLETE_SELECTED": "Marcar el conjunto seleccionado como pendiente",
    "CLICK_TO_DELETE": "Haga clic para eliminar",
    "FILTER": "Mostrar",
	"FILTER_NEW_IN_WCAG21": "Añadido en WCAG 2.1",
    "HD_CRITERIA": "Criterios de conformidad a revisar",
    "HD_SAMPLE_SELECT": "Muestra a revisar",
    "HOW_TO": "Cómo cumplir el criterio",
    "INF_AUDIT_CRITERIA": "Esta sección enumera los criterios de conformidad de las WCAG. Utilice el filtro para mostrar u ocultar los criterios de conformidad de los diferentes niveles ('A', 'AA' y 'AAA'). Puede seleccionar los resultados como: 'No Testeado', 'Pasa', 'Falla', 'No Aplica' y 'No Decide', y puede proporcionar detalles, comentarios u otras observaciones realizadas durante la revisión, en el cuadro de texto adjunto.<br>Si ha cargado el fichero JSON generado desde el servicio de diagnóstico en línea del Observatorio de Accesibilidad Web, en cada criterio de conformidad encontrará el listado de verificaciones automáticas realizadas por el servicio junto al resultado obtenido en cada una de ellas (si dicho criterio cuenta con alguna verificación automática asociada): 'Pasa', 'Falla' o 'No Aplica'. Dichas información es orientativa y no exime, en ningún caso, de realizar una revisión manual de la accesibilidad.",
    "INF_AUDIT_SAMPLE": "Esta sección enumera las páginas web que seleccionó en el paso anterior. Las páginas web que se comprueban en esta sección se enumeran cuando se activa 'Mostrar páginas web para introducir resultados individuales' en la sección 'Criterios de conformidad a revisar'. Puede mostrar una página web individual que esté evaluando o mostrar varias páginas web al mismo tiempo.<br>El icono de la cadena abre la página web en una ventana separada del navegador.",
    "INTRO_0": "",
    "INTRO": "Registre el resultado de la evaluación de las páginas web seleccionadas en el paso anterior. Compare los resultados entre la página estructurada y las páginas seleccionadas al azar, y si es necesario, ajuste la muestra seleccionada en el paso anterior. Se proporciona más información sobre este paso en <a href={{link_em_4}}>WCAG-EM Paso 4: Auditar la muestra seleccionada</a>.<br><strong>Nota:</strong> Puede introducir los resultados de cada página web individualmente para cada uno de los criterios de conformidad de WCAG 2.1. Para poder introducirlos, seleccione la(s) página(s) web debajo de 'Muestra a Evaluar' (en la columna de la izquierda); luego bajo los criterios de conformidad específicos, seleccione 'Mostrar páginas web para introducir resultados individuales'.",
    "LABEL_OUTCOME": "Resultado",
    "LABEL_PAGE_HANDLE": "Nombre corto de la página",
    "NO_PAGE_SELECTED": "No hay páginas seleccionadas en la muestra para evaluar",
    "NO_SAMPLE": "No hay ninguna muestra disponible. Cree una muestra en el paso 2 y en el paso 3.",
    "NOTE": "Nota",
    "PLH_ASSERT_DESC": "Observaciones realizadas durante la evaluación",
    "PRINCIPLE": "Principio",
    "RESULTS_FOR": "Resultados para",
    "SAMPLE_FINDINGS": "Los resultados de toda la muestra",
    "SELECT_ALL": "Seleccione todas las páginas web",
    "TESTED": "Testeado",
    "TITLE": "Paso 4: Auditar la muestra seleccionada",
    "UNDERSTAND": "Comprender el criterio",
    "UNTESTED": "{{critCount}} No Testeado",
    "LABEL_DESCR": "Descripción"
}
