{
    "TITLE": "Informe de revisión de la accesibilidad del sitio web",
    "INTRO": "A continuación se presenta el informe de revisión basado en los datos que usted ha proporcionado en los pasos anteriores. Si lo desea, puede volver a los pasos anteriores y modificar sus datos. También puede descargar los datos introducidos hasta ahora para poder trabajar en ellos más tarde (esto es lo mismo que la funcionalidad 'Guardar').<br>El objetivo de esta herramienta es la generación y descarga de este informe. A continuación, podrá descargar el Informe de Revisión de la Accesibilidad en varios formatos (HTML + CSS, ODS, XLSX y JSON).",
    "DOWNLOAD_REPORT": "Descargue y personalice este informe",
	"INFO_DOWNLOAD_REPORT": "Puede descargar el informe en varios formatos. Si, posteriormente quiere volver a cargar el informe para seguir trabajando sobre él, descargue la versión JSON. Si quiere descargarlo en formato HTML no olvide descargar también la hoja de estilos del informe (CSS) para más tarde, poder cambiar el contenido del informe y el diseño visual para satisfacer sus necesidades. Si decide descargar el informe en formato ODS o XLSX únicamente se incluirán en el informe los criterios de conformidad de nivel 'A' y 'AA' y un máximo de 35 páginas (no sucederá lo mismo si decide descargar el informe en formato JSON o HTML).",
    "BTN_SAVE_HTML": "Informe de revisión en formato HTML",
    "BTN_SAVE_CSS": "Hoja de estilos del informe (CSS)",
    "BTN_SAVE_JSON": "Informe de revisión en formato JSON",
    "BTN_SAVE_ODS": "Informe de revisión para LibreCalc (ODS)",
    "BTN_SAVE_ODS_LOAD": "Generando el informe de revisión (ODS)",
    "BTN_SAVE_ODS_INFO": "<strong>Nota importante:</strong> Una vez descargado el fichero ODS, la primera vez que lo abra, puede ser necesario forzar el cálculo de las distintas fórmulas: <ul><li>Para ello, en <strong>LibreOffice</strong> vaya a la opción de menú <em>Datos > Calcular > Recalculación incondicional</em> o pulse <em>Shift+Ctrl+F9</em>.</li></ul> ",
    "BTN_SAVE_XLSX": "Informe de revisión en formato Microsoft Excel (XLSX).",
    "BTN_SAVE_XLSX_LOAD": "Generando el informe de revisión (XLSX)"
}