{
    "TITLE": "Paso 2: Explorar el sitio web objetivo",
    "INTRO": "Explore el sitio web para entender su propósito, funcionalidad y uso. Este paso le ayudará a determinar qué páginas web deberá seleccionar para la revisión en los próximos pasos. Identifique las tecnologías web en las que se ha confiado la conformidad de la accesibilidad de acuerdo con las WCAG para desarrollar el sitio web. Por lo general, la mejor manera de obtener esta información es poniéndose en contacto con los desarrolladores del sitio web. Puede obtener más información sobre este paso en <a href={{link_em_2}} hreflang='en' title='WCAG-EM Paso 2: Explorar el sitio web de destino (abre en nueva ventana)'>WCAG-EM Paso 2: Explorar el sitio web de destino</a>.",
    "HD_RELIEDUP_TECH": "Tecnologías web en las que se basa la conformidad de la accesibilidad",
    "INF_RELIEDUP_TECH": "Identificar las tecnologías web en las que se ha confiado la <a href={{link_relied_upon}} hreflang='en' title='conformidad de la accesibilidad de acuerdo con las WCAG (abre en nueva ventana)'>conformidad de la accesibilidad de acuerdo con las WCAG</a> para desarrollar el sitio web. Esto incluye tecnologías web base como HTML y CSS, tecnologías web auxiliares como JavaScript y WAI-ARIA, así como tecnologías web específicas como SMIL, SVG y PDF. A menudo, también es útil identificar el sistema de gestión de contenido (CMS), versión y configuración, ya que puede ser relevante para explicar los resultados de la evaluación. Además, las bibliotecas y componentes utilizados para crear el sitio web, como Dojo, jQuery y otros, pueden ser relevantes. Particularmente para las aplicaciones web, gran parte del soporte de accesibilidad está integrado en bibliotecas y componentes y la evaluación puede ser más efectiva y eficiente cuando se identifican. La utilidad de rellenar la información aquí recogida es facilitar el proceso de selección de la muestra, así como ver la coherencia en los resultados de la evaluación. Para más información, ver <a href={{link_em_2d}} hreflang='en' title='WCAG-EM Paso 2.d: Identificar las tecnologías web en las que se basa la conformidad de la accesibilidad (abre en nueva ventana)'>WCAG-EM Paso 2.d: Identificar las tecnologías web en las que se basa la conformidad de la accesibilidad</a>.<br><strong>Nota:</strong> Para añadir otras tecnologías, seleccione 'Otros' y utilice el campo 'Tecnología web' y 'Dirección de la especificación (URL)'. El campo 'Dirección de la Especificación (URL)' debe identificar la especificación de la tecnología web.",
    "LABEL_TECH": "Tecnología web",
    "LABEL_TECH_SPEC": "Dirección de la Especificación (URL)",
    "PLH_TECH": "P.e. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Dirección (URL) o descripción para la especificación de la tecnología web",
    "BTN_REMOVE_TECH": "Eliminar la tecnología web",
    "BTN_ADD_TECH": "Añadir la tecnología web",
    "HD_NOTE_TAKING": "Notas de exploración opcionales",
    "INF_NOTE_TAKING": "Esta sección le permite registrar información durante la exploración de su sitio web. Estas notas serán mostradas en el siguiente paso, para ayudarle a seleccionar una muestra de páginas web significativas. <strong>Estas notas no serán incluidas en el informe final.</strong> Se guardarán junto al archivo cuando lo guarde y estarán disponibles nuevamente cuando lo vuelva a abrir más tarde.",
    "LABEL_ESSENT_FUNC": "Funcionalidad esencial del sitio web",
    "INF_ESSENT_FUNC": "Puede utilizar este campo para tomar notas sobre la funcionalidad esencial del sitio web. Ejemplos de funcionalidad esencial incluyen:<ul><li>completar y enviar un formulario proporcionado en el sitio web</li><li>registrarse para una cuenta en el sitio web</li></ul>Para más información, ver <a href={{link_em_2b}} hreflang='en' title='WCAG-EM Paso 2.b: Identificar la funcionalidad esencial del sitio web (abre en nueva ventana)'>WCAG-EM Paso 2.b: Identificar la funcionalidad esencial del sitio web</a>.",
    "LABEL_VARIETY_PAGE_TYPES": "Variedad de tipos de páginas web",
    "INF_VARIETY_PAGE_TYPES": "Puede utilizar este campo para tomar notas sobre los tipos de páginas web que se pueden encontrar dentro del sitio web. Esto incluye notas sobre los diferentes estilos, diseños, estructuras y funcionalidades que se ofrecen en el sitio web.<br>Para más información consulte <a href={{link_em_2c}} hreflang='en' title='WCAG-EM Paso 2.c: Identificar la variedad de tipos de páginas web (abre en nueva ventana)'>WCAG-EM Paso 2.c: Identificar la variedad de tipos de páginas web</a>.<br><strong>Nota:</strong> Las 'páginas web' incluyen diferentes 'estados de página web' (véase definición de <a href={{link_page_state}} hreflang='en' title='estados de página web (abre en nueva ventana)'>estados de página web</a>).",
    "LABEL_OTHER": "Otros..."
}
