{
    "TITLE":"Herramienta de informes del WCAG-EM",
    "SUBTITLE": "Generador de Informes de Revisión de la Accesibilidad del sitio web",
    "INTRO_HD": "¿Qué hace esta herramienta?",
    "INTRO_1": "Esta herramienta le ayudará a generar un informe de acuerdo con la <a href={{link_wcagem}}>Metodología de revisión de Conformidad de Accesibilidad al Sitio Web (WCAG-EM)</a> pero NO realiza ninguna comprobación de accesibilidad. Le guiará, paso a paso, para generar un <a href={{link_report}}>informe estructurado</a> a partir de la información que usted proporcione. Está especialmente diseñado para evaluadores experimentados que conozcan las <a href={{link_wcag}}> Pautas de Accesibilidad al Contenido en la Web (WCAG) 2.1</a> y estén algo familiarizados con WCAG-EM. Si desea un ver una pequeña introducción a las WCAG-EM, visite el <a href={{link_conformance}}>Resumen de las WCAG-EM</a>.",
    "INTRO_2": "<strong>Nota:</strong> Esta herramienta no guarda automáticamente la información que usted introduce. Para guardar los datos en un archivo local (en su computadora), utilice las teclas de atajo de Windows Ctrl+S o las teclas de atajo de Mac {{mac}} para abrir el cuadro de diálogo Guardar, o utilice el enlace 'Guardar' que encontrará en la parte superior de la página. Esto abrirá la página 'Guardar el Informe de revisión' y, desde allí, el enlace 'Guardar el archivo de datos localmente en su computadora' abrirá el cuadro de diálogo Guardar).",
    "USAGE_HD": "¿Cómo funciona esta herramienta?",
    "USAGE_LI1": "Toda la funcionalidad proporcionada por esta herramienta está ahora cargada y ejecutándose localmente en su navegador web. No necesitará una conexión a Internet más allá de este punto. Cuando cierre la ventana de su navegador, cualquier dato no guardado, se perderá.",
    "USAGE_LI2": "Toda la información que usted vaya añadiendo a través de esta herramienta será alamcenada temporalmente en un fichero JSON en segundo plano (en su navegador web, no en ningún servidor). Debe guardar periódicamente mientras trabaje, para evitar la pérdida de datos si su navegador web se cierra.",
    "USAGE_LI3": "Puede guardar informes parcialmente completos y trabajar en ellos más tarde. Para abrir un archivo guardado, use el enlace 'Abrir' en la parte superior y seleccione el archivo que ha guardado anteriormente.",
    "USAGE_LI4": "Todos los enlaces que no formen parte la herramienta (enlaces a recursos externos), se abrirán en una nueva ventana del navegador.",
    "TIPS_HD": "Consejos para usar esta herramienta",
    "TIPS_LI1": "Puede moverse con total libertad entre los distintos pasos. Ninguno de sus campos son obligatorios.",
    "TIPS_LI2": "Para obtener más información sobre un campo, seleccione el icono {{info}} junto a la etiqueta del campo.",
    "TIPS_LI3": "La herramienta generará un informe de revisión de la accesibilidad en varios formatos (HTML, ODS, XLSX y JSON). Puede descargar estos archivos desde la página 'Ver informe'. Si descaga la versión en HTML junto a la hoja de estilos CSS, podrá cambiar posteriormente el contenido del informe y el diseño visual.",
    "TIPS_LI4": "Puede incluir en su informe los criterios de conformidad de las WCAG 2.1 más allá del objetivo de conformidad exigido por ley (recuerde que el nivel de cumplimiento exigido por ley es 'AA' que es el nivel requerido por la norma española UNE-EN 301549:20195, traducción al español de la norma EN 301 549 V2.1.2 (2018-08), que es la norma armonizada declarada por la Comisión Europea en la Decisión de Ejecución (UE) 2018/2048 y alineada con las WCAG 2.1 del W3C). Por ejemplo, aunque la página web sólo esté obligada a cumplir con el nivel de cumplimiento AA, puede incluir también los criterios de conformidad de nivel AAA en el informe. En el paso 4, utilice el filtro de nivel para mostrar los criterios de nivel superior. Cualquier criterio de conformidad que disponga de un resultado siempre será incluido en el informe, salvo que la exportación se realice en un fichero ODS (LibreOffice) o en un fichero XLSX (Microsoft Excel), en cuyo caso, no serán incluidos estos criterios (criterios de conformidad de nivel AAA)."
}