{
    "TITLE":"Paso 5: Informe de los resultados de la revisión",
    "INTRO": "Proporcione información adicional sobre la revisión que desee que se incluya en el informe. Los resultados de la revisión que usted introdujo en el paso anterior se muestran a continuación en 'Resultados detallados de la auditoría' para su revisión y para ayudarle a escribir el resumen ejecutivo. Puede obtener más información sobre este paso en <a href={{link_em_5}} hreflang='en' title='WCAG-EM Paso 5: Informe de los resultados de la revisión (abre en nueva ventana)'>WCAG-EM Paso 5: Informe de los resultados de la revisión</a>.",
    "LABEL_TITLE": "Título del informe",
    "TITLE_PREFIX": "Informe para",
    "INF_TITLE": "Proporcione un título para el Informe de Revisión de la Accesibilidad del sitio web. Por ejemplo:<ul><li>Informe de revisión de la accesibilidad del Organismo Ejemplo</li><li>Análisis de accesibilidad de la sede electrónica y sugerencias de mejora de la accesibilidad</li></ul>",
    "LABEL_COMMISSIONER": "Comisión de revisión",
    "INF_COMMISSIONER": "La persona, equipo de personas, organización, departamento interno u otra entidad que <strong>encargó la revisión</strong>.",
    "LABEL_CREATOR": "Evaluador",
    "INF_CREATOR": "La persona, equipo de personas, organización, departamento interno, u otra entidad <strong>responsable de llevar a cabo la revisión</strong>.",
    "LABEL_DATE": "Fecha de revisión",
    "INF_DATE": "Proporcione la fecha de finalización o las fechas de duración de esta revisión. Puede utilizar cualquier formato de fecha.",
    "LABEL_SUMMARY": "Resumen ejecutivo",
    "INF_SUMMARY": "Proporcione un breve resumen de los resultados de la revisión para dar una visión general de los resultados. Por ejemplo, describa la accesibilidad general del sitio web y las principales observaciones que haya hecho durante la revisión, como los problemas y errores que se produzcan con frecuencia.",
    "LABEL_SPECIFICS": "Registro de los detalles de la revisión (opcional)",
    "INF_SPECIFICS": "WCAG-EM le sugiere que archive las páginas web auditadas. Para más información, acceda a <a href={{link_em_5b}} hreflang='en' title='WCAG-EM Paso 5.b: Registrar los detalles de la revisión (abre en nueva ventana)'>WCAG-EM Paso 5.b: Registrar los detalles de la revisión</a>. Puede utilizar este campo de texto para registrar las herramientas de revisión, los navegadores web, las tecnologías de asistencia, otros programas informáticos y los métodos utilizados para la revisión. Lo que introduzca aquí será incluido en el informe generado. Después de descargar el informe, podrá borrar o editar esta información en el archivo HTML antes de enviar el informe.",
    "HD_CRITERIA_REPORT": "Resultados detallados de la auditoría",
    "REPORT_FINISHED": "<strong>Revisión finalizada:</strong> Sí",
    "REPORT_UNFINISHED": "<strong>Revisión finalizada:</strong> NO",
    "REPORT_UNFINISHED_INFO": "Existen criterios de validación marcados como 'No testeado' o 'No decide'."
}